GopalSaraf/Practicals/PSDL/include/proc/pic16lf1769.inc
// Register: DAC1REFL
#define DAC1REFL DAC1REFL
DAC1REFL                                 equ 0592h
// bitfield definitions
DAC1REFL_REF0_POSN                       equ 0000h
DAC1REFL_REF0_POSITION                   equ 0000h
DAC1REFL_REF0_SIZE                       equ 0001h
DAC1REFL_REF0_LENGTH                     equ 0001h
DAC1REFL_REF0_MASK                       equ 0001h
DAC1REFL_REF1_POSN                       equ 0001h
DAC1REFL_REF1_POSITION                   equ 0001h
DAC1REFL_REF1_SIZE                       equ 0001h
DAC1REFL_REF1_LENGTH                     equ 0001h
DAC1REFL_REF1_MASK                       equ 0002h
DAC1REFL_REF2_POSN                       equ 0002h
DAC1REFL_REF2_POSITION                   equ 0002h
DAC1REFL_REF2_SIZE                       equ 0001h
DAC1REFL_REF2_LENGTH                     equ 0001h
DAC1REFL_REF2_MASK                       equ 0004h
DAC1REFL_REF3_POSN                       equ 0003h
DAC1REFL_REF3_POSITION                   equ 0003h
DAC1REFL_REF3_SIZE                       equ 0001h
DAC1REFL_REF3_LENGTH                     equ 0001h
DAC1REFL_REF3_MASK                       equ 0008h
DAC1REFL_REF4_POSN                       equ 0004h
DAC1REFL_REF4_POSITION                   equ 0004h
DAC1REFL_REF4_SIZE                       equ 0001h
DAC1REFL_REF4_LENGTH                     equ 0001h
DAC1REFL_REF4_MASK                       equ 0010h
DAC1REFL_REF5_POSN                       equ 0005h
DAC1REFL_REF5_POSITION                   equ 0005h
DAC1REFL_REF5_SIZE                       equ 0001h
DAC1REFL_REF5_LENGTH                     equ 0001h
DAC1REFL_REF5_MASK                       equ 0020h
DAC1REFL_REF6_POSN                       equ 0006h
DAC1REFL_REF6_POSITION                   equ 0006h
DAC1REFL_REF6_SIZE                       equ 0001h
DAC1REFL_REF6_LENGTH                     equ 0001h
DAC1REFL_REF6_MASK                       equ 0040h
DAC1REFL_REF7_POSN                       equ 0007h
DAC1REFL_REF7_POSITION                   equ 0007h
DAC1REFL_REF7_SIZE                       equ 0001h
DAC1REFL_REF7_LENGTH                     equ 0001h
DAC1REFL_REF7_MASK                       equ 0080h
DAC1REFL_DAC1REF0_POSN                   equ 0000h
DAC1REFL_DAC1REF0_POSITION               equ 0000h
DAC1REFL_DAC1REF0_SIZE                   equ 0001h
DAC1REFL_DAC1REF0_LENGTH                 equ 0001h
DAC1REFL_DAC1REF0_MASK                   equ 0001h
DAC1REFL_DAC1REF1_POSN                   equ 0001h
DAC1REFL_DAC1REF1_POSITION               equ 0001h
DAC1REFL_DAC1REF1_SIZE                   equ 0001h
DAC1REFL_DAC1REF1_LENGTH                 equ 0001h
DAC1REFL_DAC1REF1_MASK                   equ 0002h
DAC1REFL_DAC1REF2_POSN                   equ 0002h
DAC1REFL_DAC1REF2_POSITION               equ 0002h
DAC1REFL_DAC1REF2_SIZE                   equ 0001h
DAC1REFL_DAC1REF2_LENGTH                 equ 0001h
DAC1REFL_DAC1REF2_MASK                   equ 0004h
DAC1REFL_DAC1REF3_POSN                   equ 0003h
DAC1REFL_DAC1REF3_POSITION               equ 0003h
DAC1REFL_DAC1REF3_SIZE                   equ 0001h
DAC1REFL_DAC1REF3_LENGTH                 equ 0001h
DAC1REFL_DAC1REF3_MASK                   equ 0008h
DAC1REFL_DAC1REF4_POSN                   equ 0004h
DAC1REFL_DAC1REF4_POSITION               equ 0004h
DAC1REFL_DAC1REF4_SIZE                   equ 0001h
DAC1REFL_DAC1REF4_LENGTH                 equ 0001h
DAC1REFL_DAC1REF4_MASK                   equ 0010h
DAC1REFL_DAC1REF5_POSN                   equ 0005h
DAC1REFL_DAC1REF5_POSITION               equ 0005h
DAC1REFL_DAC1REF5_SIZE                   equ 0001h
DAC1REFL_DAC1REF5_LENGTH                 equ 0001h
DAC1REFL_DAC1REF5_MASK                   equ 0020h
DAC1REFL_DAC1REF6_POSN                   equ 0006h
DAC1REFL_DAC1REF6_POSITION               equ 0006h
DAC1REFL_DAC1REF6_SIZE                   equ 0001h
DAC1REFL_DAC1REF6_LENGTH                 equ 0001h
DAC1REFL_DAC1REF6_MASK                   equ 0040h
DAC1REFL_DAC1REF7_POSN                   equ 0007h
DAC1REFL_DAC1REF7_POSITION               equ 0007h
DAC1REFL_DAC1REF7_SIZE                   equ 0001h
DAC1REFL_DAC1REF7_LENGTH                 equ 0001h
DAC1REFL_DAC1REF7_MASK                   equ 0080h
DAC1REFL_R0_POSN                         equ 0000h
DAC1REFL_R0_POSITION                     equ 0000h
DAC1REFL_R0_SIZE                         equ 0001h
DAC1REFL_R0_LENGTH                       equ 0001h
DAC1REFL_R0_MASK                         equ 0001h
DAC1REFL_R1_POSN                         equ 0001h
DAC1REFL_R1_POSITION                     equ 0001h
DAC1REFL_R1_SIZE                         equ 0001h
DAC1REFL_R1_LENGTH                       equ 0001h
DAC1REFL_R1_MASK                         equ 0002h
DAC1REFL_R2_POSN                         equ 0002h
DAC1REFL_R2_POSITION                     equ 0002h
DAC1REFL_R2_SIZE                         equ 0001h
DAC1REFL_R2_LENGTH                       equ 0001h
DAC1REFL_R2_MASK                         equ 0004h
DAC1REFL_R3_POSN                         equ 0003h
DAC1REFL_R3_POSITION                     equ 0003h
DAC1REFL_R3_SIZE                         equ 0001h
DAC1REFL_R3_LENGTH                       equ 0001h
DAC1REFL_R3_MASK                         equ 0008h
DAC1REFL_R4_POSN                         equ 0004h
DAC1REFL_R4_POSITION                     equ 0004h
DAC1REFL_R4_SIZE                         equ 0001h
DAC1REFL_R4_LENGTH                       equ 0001h
DAC1REFL_R4_MASK                         equ 0010h
DAC1REFL_R5_POSN                         equ 0005h
DAC1REFL_R5_POSITION                     equ 0005h
DAC1REFL_R5_SIZE                         equ 0001h
DAC1REFL_R5_LENGTH                       equ 0001h
DAC1REFL_R5_MASK                         equ 0020h
DAC1REFL_R6_POSN                         equ 0006h
DAC1REFL_R6_POSITION                     equ 0006h
DAC1REFL_R6_SIZE                         equ 0001h
DAC1REFL_R6_LENGTH                       equ 0001h
DAC1REFL_R6_MASK                         equ 0040h
DAC1REFL_R7_POSN                         equ 0007h
DAC1REFL_R7_POSITION                     equ 0007h
DAC1REFL_R7_SIZE                         equ 0001h
DAC1REFL_R7_LENGTH                       equ 0001h
DAC1REFL_R7_MASK                         equ 0080h
DAC1REFL_DAC1R0_POSN                     equ 0000h
DAC1REFL_DAC1R0_POSITION                 equ 0000h
DAC1REFL_DAC1R0_SIZE                     equ 0001h
DAC1REFL_DAC1R0_LENGTH                   equ 0001h
DAC1REFL_DAC1R0_MASK                     equ 0001h
DAC1REFL_DAC1R1_POSN                     equ 0001h
DAC1REFL_DAC1R1_POSITION                 equ 0001h
DAC1REFL_DAC1R1_SIZE                     equ 0001h
DAC1REFL_DAC1R1_LENGTH                   equ 0001h
DAC1REFL_DAC1R1_MASK                     equ 0002h
DAC1REFL_DAC1R2_POSN                     equ 0002h
DAC1REFL_DAC1R2_POSITION                 equ 0002h
DAC1REFL_DAC1R2_SIZE                     equ 0001h
DAC1REFL_DAC1R2_LENGTH                   equ 0001h
DAC1REFL_DAC1R2_MASK                     equ 0004h
DAC1REFL_DAC1R3_POSN                     equ 0003h
DAC1REFL_DAC1R3_POSITION                 equ 0003h
DAC1REFL_DAC1R3_SIZE                     equ 0001h
DAC1REFL_DAC1R3_LENGTH                   equ 0001h
DAC1REFL_DAC1R3_MASK                     equ 0008h
DAC1REFL_DAC1R4_POSN                     equ 0004h
DAC1REFL_DAC1R4_POSITION                 equ 0004h
DAC1REFL_DAC1R4_SIZE                     equ 0001h
DAC1REFL_DAC1R4_LENGTH                   equ 0001h
DAC1REFL_DAC1R4_MASK                     equ 0010h
DAC1REFL_DAC1R5_POSN                     equ 0005h
DAC1REFL_DAC1R5_POSITION                 equ 0005h
DAC1REFL_DAC1R5_SIZE                     equ 0001h
DAC1REFL_DAC1R5_LENGTH                   equ 0001h
DAC1REFL_DAC1R5_MASK                     equ 0020h
DAC1REFL_DAC1R6_POSN                     equ 0006h
DAC1REFL_DAC1R6_POSITION                 equ 0006h
DAC1REFL_DAC1R6_SIZE                     equ 0001h
DAC1REFL_DAC1R6_LENGTH                   equ 0001h
DAC1REFL_DAC1R6_MASK                     equ 0040h
DAC1REFL_DAC1R7_POSN                     equ 0007h
DAC1REFL_DAC1R7_POSITION                 equ 0007h
DAC1REFL_DAC1R7_SIZE                     equ 0001h
DAC1REFL_DAC1R7_LENGTH                   equ 0001h
DAC1REFL_DAC1R7_MASK                     equ 0080h

// Register: DAC1REFH
#define DAC1REFH DAC1REFH
DAC1REFH                                 equ 0593h
// bitfield definitions
DAC1REFH_REF8_POSN                       equ 0000h
DAC1REFH_REF8_POSITION                   equ 0000h
DAC1REFH_REF8_SIZE                       equ 0001h
DAC1REFH_REF8_LENGTH                     equ 0001h
DAC1REFH_REF8_MASK                       equ 0001h
DAC1REFH_REF9_POSN                       equ 0001h
DAC1REFH_REF9_POSITION                   equ 0001h
DAC1REFH_REF9_SIZE                       equ 0001h
DAC1REFH_REF9_LENGTH                     equ 0001h
DAC1REFH_REF9_MASK                       equ 0002h
DAC1REFH_REF10_POSN                      equ 0002h
DAC1REFH_REF10_POSITION                  equ 0002h
DAC1REFH_REF10_SIZE                      equ 0001h
DAC1REFH_REF10_LENGTH                    equ 0001h
DAC1REFH_REF10_MASK                      equ 0004h
DAC1REFH_REF11_POSN                      equ 0003h
DAC1REFH_REF11_POSITION                  equ 0003h
DAC1REFH_REF11_SIZE                      equ 0001h
DAC1REFH_REF11_LENGTH                    equ 0001h
DAC1REFH_REF11_MASK                      equ 0008h
DAC1REFH_REF12_POSN                      equ 0004h
DAC1REFH_REF12_POSITION                  equ 0004h
DAC1REFH_REF12_SIZE                      equ 0001h
DAC1REFH_REF12_LENGTH                    equ 0001h
DAC1REFH_REF12_MASK                      equ 0010h
DAC1REFH_REF13_POSN                      equ 0005h
DAC1REFH_REF13_POSITION                  equ 0005h
DAC1REFH_REF13_SIZE                      equ 0001h
DAC1REFH_REF13_LENGTH                    equ 0001h
DAC1REFH_REF13_MASK                      equ 0020h
DAC1REFH_REF14_POSN                      equ 0006h
DAC1REFH_REF14_POSITION                  equ 0006h
DAC1REFH_REF14_SIZE                      equ 0001h
DAC1REFH_REF14_LENGTH                    equ 0001h
DAC1REFH_REF14_MASK                      equ 0040h
DAC1REFH_REF15_POSN                      equ 0007h
DAC1REFH_REF15_POSITION                  equ 0007h
DAC1REFH_REF15_SIZE                      equ 0001h
DAC1REFH_REF15_LENGTH                    equ 0001h
DAC1REFH_REF15_MASK                      equ 0080h
DAC1REFH_DAC1REF8_POSN                   equ 0000h
DAC1REFH_DAC1REF8_POSITION               equ 0000h
DAC1REFH_DAC1REF8_SIZE                   equ 0001h
DAC1REFH_DAC1REF8_LENGTH                 equ 0001h
DAC1REFH_DAC1REF8_MASK                   equ 0001h
DAC1REFH_DAC1REF9_POSN                   equ 0001h
DAC1REFH_DAC1REF9_POSITION               equ 0001h
DAC1REFH_DAC1REF9_SIZE                   equ 0001h
DAC1REFH_DAC1REF9_LENGTH                 equ 0001h
DAC1REFH_DAC1REF9_MASK                   equ 0002h
DAC1REFH_DAC1REF10_POSN                  equ 0002h
DAC1REFH_DAC1REF10_POSITION              equ 0002h
DAC1REFH_DAC1REF10_SIZE                  equ 0001h
DAC1REFH_DAC1REF10_LENGTH                equ 0001h
DAC1REFH_DAC1REF10_MASK                  equ 0004h
DAC1REFH_DAC1REF11_POSN                  equ 0003h
DAC1REFH_DAC1REF11_POSITION              equ 0003h
DAC1REFH_DAC1REF11_SIZE                  equ 0001h
DAC1REFH_DAC1REF11_LENGTH                equ 0001h
DAC1REFH_DAC1REF11_MASK                  equ 0008h
DAC1REFH_DAC1REF12_POSN                  equ 0004h
DAC1REFH_DAC1REF12_POSITION              equ 0004h
DAC1REFH_DAC1REF12_SIZE                  equ 0001h
DAC1REFH_DAC1REF12_LENGTH                equ 0001h
DAC1REFH_DAC1REF12_MASK                  equ 0010h
DAC1REFH_DAC1REF13_POSN                  equ 0005h
DAC1REFH_DAC1REF13_POSITION              equ 0005h
DAC1REFH_DAC1REF13_SIZE                  equ 0001h
DAC1REFH_DAC1REF13_LENGTH                equ 0001h
DAC1REFH_DAC1REF13_MASK                  equ 0020h
DAC1REFH_DAC1REF14_POSN                  equ 0006h
DAC1REFH_DAC1REF14_POSITION              equ 0006h
DAC1REFH_DAC1REF14_SIZE                  equ 0001h
DAC1REFH_DAC1REF14_LENGTH                equ 0001h
DAC1REFH_DAC1REF14_MASK                  equ 0040h
DAC1REFH_DAC1REF15_POSN                  equ 0007h
DAC1REFH_DAC1REF15_POSITION              equ 0007h
DAC1REFH_DAC1REF15_SIZE                  equ 0001h
DAC1REFH_DAC1REF15_LENGTH                equ 0001h
DAC1REFH_DAC1REF15_MASK                  equ 0080h
DAC1REFH_R8_POSN                         equ 0000h
DAC1REFH_R8_POSITION                     equ 0000h
DAC1REFH_R8_SIZE                         equ 0001h
DAC1REFH_R8_LENGTH                       equ 0001h
DAC1REFH_R8_MASK                         equ 0001h
DAC1REFH_R9_POSN                         equ 0001h
DAC1REFH_R9_POSITION                     equ 0001h
DAC1REFH_R9_SIZE                         equ 0001h
DAC1REFH_R9_LENGTH                       equ 0001h
DAC1REFH_R9_MASK                         equ 0002h
DAC1REFH_R10_POSN                        equ 0002h
DAC1REFH_R10_POSITION                    equ 0002h
DAC1REFH_R10_SIZE                        equ 0001h
DAC1REFH_R10_LENGTH                      equ 0001h
DAC1REFH_R10_MASK                        equ 0004h
DAC1REFH_R11_POSN                        equ 0003h
DAC1REFH_R11_POSITION                    equ 0003h
DAC1REFH_R11_SIZE                        equ 0001h
DAC1REFH_R11_LENGTH                      equ 0001h
DAC1REFH_R11_MASK                        equ 0008h
DAC1REFH_R12_POSN                        equ 0004h
DAC1REFH_R12_POSITION                    equ 0004h
DAC1REFH_R12_SIZE                        equ 0001h
DAC1REFH_R12_LENGTH                      equ 0001h
DAC1REFH_R12_MASK                        equ 0010h
DAC1REFH_R13_POSN                        equ 0005h
DAC1REFH_R13_POSITION                    equ 0005h
DAC1REFH_R13_SIZE                        equ 0001h
DAC1REFH_R13_LENGTH                      equ 0001h
DAC1REFH_R13_MASK                        equ 0020h
DAC1REFH_R14_POSN                        equ 0006h
DAC1REFH_R14_POSITION                    equ 0006h
DAC1REFH_R14_SIZE                        equ 0001h
DAC1REFH_R14_LENGTH                      equ 0001h
DAC1REFH_R14_MASK                        equ 0040h
DAC1REFH_R15_POSN                        equ 0007h
DAC1REFH_R15_POSITION                    equ 0007h
DAC1REFH_R15_SIZE                        equ 0001h
DAC1REFH_R15_LENGTH                      equ 0001h
DAC1REFH_R15_MASK                        equ 0080h
DAC1REFH_DAC1R8_POSN                     equ 0000h
DAC1REFH_DAC1R8_POSITION                 equ 0000h
DAC1REFH_DAC1R8_SIZE                     equ 0001h
DAC1REFH_DAC1R8_LENGTH                   equ 0001h
DAC1REFH_DAC1R8_MASK                     equ 0001h
DAC1REFH_DAC1R9_POSN                     equ 0001h
DAC1REFH_DAC1R9_POSITION                 equ 0001h
DAC1REFH_DAC1R9_SIZE                     equ 0001h
DAC1REFH_DAC1R9_LENGTH                   equ 0001h
DAC1REFH_DAC1R9_MASK                     equ 0002h
DAC1REFH_DAC1R10_POSN                    equ 0002h
DAC1REFH_DAC1R10_POSITION                equ 0002h
DAC1REFH_DAC1R10_SIZE                    equ 0001h
DAC1REFH_DAC1R10_LENGTH                  equ 0001h
DAC1REFH_DAC1R10_MASK                    equ 0004h
DAC1REFH_DAC1R11_POSN                    equ 0003h
DAC1REFH_DAC1R11_POSITION                equ 0003h
DAC1REFH_DAC1R11_SIZE                    equ 0001h
DAC1REFH_DAC1R11_LENGTH                  equ 0001h
DAC1REFH_DAC1R11_MASK                    equ 0008h
DAC1REFH_DAC1R12_POSN                    equ 0004h
DAC1REFH_DAC1R12_POSITION                equ 0004h
DAC1REFH_DAC1R12_SIZE                    equ 0001h
DAC1REFH_DAC1R12_LENGTH                  equ 0001h
DAC1REFH_DAC1R12_MASK                    equ 0010h
DAC1REFH_DAC1R13_POSN                    equ 0005h
DAC1REFH_DAC1R13_POSITION                equ 0005h
DAC1REFH_DAC1R13_SIZE                    equ 0001h
DAC1REFH_DAC1R13_LENGTH                  equ 0001h
DAC1REFH_DAC1R13_MASK                    equ 0020h
DAC1REFH_DAC1R14_POSN                    equ 0006h
DAC1REFH_DAC1R14_POSITION                equ 0006h
DAC1REFH_DAC1R14_SIZE                    equ 0001h
DAC1REFH_DAC1R14_LENGTH                  equ 0001h
DAC1REFH_DAC1R14_MASK                    equ 0040h
DAC1REFH_DAC1R15_POSN                    equ 0007h
DAC1REFH_DAC1R15_POSITION                equ 0007h
DAC1REFH_DAC1R15_SIZE                    equ 0001h
DAC1REFH_DAC1R15_LENGTH                  equ 0001h
DAC1REFH_DAC1R15_MASK                    equ 0080h

// Register: DAC2CON0
#define DAC2CON0 DAC2CON0
DAC2CON0                                 equ 0594h
// bitfield definitions
DAC2CON0_NSS_POSN                        equ 0000h
DAC2CON0_NSS_POSITION                    equ 0000h
DAC2CON0_NSS_SIZE                        equ 0002h
DAC2CON0_NSS_LENGTH                      equ 0002h
DAC2CON0_NSS_MASK                        equ 0003h
DAC2CON0_PSS_POSN                        equ 0002h
DAC2CON0_PSS_POSITION                    equ 0002h
DAC2CON0_PSS_SIZE                        equ 0002h
DAC2CON0_PSS_LENGTH                      equ 0002h
DAC2CON0_PSS_MASK                        equ 000Ch
DAC2CON0_OE1_POSN                        equ 0005h
DAC2CON0_OE1_POSITION                    equ 0005h
DAC2CON0_OE1_SIZE                        equ 0001h
DAC2CON0_OE1_LENGTH                      equ 0001h
DAC2CON0_OE1_MASK                        equ 0020h
DAC2CON0_FM_POSN                         equ 0006h
DAC2CON0_FM_POSITION                     equ 0006h
DAC2CON0_FM_SIZE                         equ 0001h
DAC2CON0_FM_LENGTH                       equ 0001h
DAC2CON0_FM_MASK                         equ 0040h
DAC2CON0_EN_POSN                         equ 0007h
DAC2CON0_EN_POSITION                     equ 0007h
DAC2CON0_EN_SIZE                         equ 0001h
DAC2CON0_EN_LENGTH                       equ 0001h
DAC2CON0_EN_MASK                         equ 0080h
DAC2CON0_NSS0_POSN                       equ 0000h
DAC2CON0_NSS0_POSITION                   equ 0000h
DAC2CON0_NSS0_SIZE                       equ 0001h
DAC2CON0_NSS0_LENGTH                     equ 0001h
DAC2CON0_NSS0_MASK                       equ 0001h
DAC2CON0_PSS0_POSN                       equ 0002h
DAC2CON0_PSS0_POSITION                   equ 0002h
DAC2CON0_PSS0_SIZE                       equ 0001h
DAC2CON0_PSS0_LENGTH                     equ 0001h
DAC2CON0_PSS0_MASK                       equ 0004h
DAC2CON0_PSS1_POSN                       equ 0003h
DAC2CON0_PSS1_POSITION                   equ 0003h
DAC2CON0_PSS1_SIZE                       equ 0001h
DAC2CON0_PSS1_LENGTH                     equ 0001h
DAC2CON0_PSS1_MASK                       equ 0008h
DAC2CON0_OE_POSN                         equ 0005h
DAC2CON0_OE_POSITION                     equ 0005h
DAC2CON0_OE_SIZE                         equ 0001h
DAC2CON0_OE_LENGTH                       equ 0001h
DAC2CON0_OE_MASK                         equ 0020h
DAC2CON0_DACNSS_POSN                     equ 0000h
DAC2CON0_DACNSS_POSITION                 equ 0000h
DAC2CON0_DACNSS_SIZE                     equ 0002h
DAC2CON0_DACNSS_LENGTH                   equ 0002h
DAC2CON0_DACNSS_MASK                     equ 0003h
DAC2CON0_DACPSS_POSN                     equ 0002h
DAC2CON0_DACPSS_POSITION                 equ 0002h
DAC2CON0_DACPSS_SIZE                     equ 0002h
DAC2CON0_DACPSS_LENGTH                   equ 0002h
DAC2CON0_DACPSS_MASK                     equ 000Ch
DAC2CON0_DACOE1_POSN                     equ 0005h
DAC2CON0_DACOE1_POSITION                 equ 0005h
DAC2CON0_DACOE1_SIZE                     equ 0001h
DAC2CON0_DACOE1_LENGTH                   equ 0001h
DAC2CON0_DACOE1_MASK                     equ 0020h
DAC2CON0_DACFM_POSN                      equ 0006h
DAC2CON0_DACFM_POSITION                  equ 0006h
DAC2CON0_DACFM_SIZE                      equ 0001h
DAC2CON0_DACFM_LENGTH                    equ 0001h
DAC2CON0_DACFM_MASK                      equ 0040h
DAC2CON0_DACEN_POSN                      equ 0007h
DAC2CON0_DACEN_POSITION                  equ 0007h
DAC2CON0_DACEN_SIZE                      equ 0001h
DAC2CON0_DACEN_LENGTH                    equ 0001h
DAC2CON0_DACEN_MASK                      equ 0080h
DAC2CON0_DACNSS0_POSN                    equ 0000h
DAC2CON0_DACNSS0_POSITION                equ 0000h
DAC2CON0_DACNSS0_SIZE                    equ 0001h
DAC2CON0_DACNSS0_LENGTH                  equ 0001h
DAC2CON0_DACNSS0_MASK                    equ 0001h
DAC2CON0_DACPSS0_POSN                    equ 0002h
DAC2CON0_DACPSS0_POSITION                equ 0002h
DAC2CON0_DACPSS0_SIZE                    equ 0001h
DAC2CON0_DACPSS0_LENGTH                  equ 0001h
DAC2CON0_DACPSS0_MASK                    equ 0004h
DAC2CON0_DACPSS1_POSN                    equ 0003h
DAC2CON0_DACPSS1_POSITION                equ 0003h
DAC2CON0_DACPSS1_SIZE                    equ 0001h
DAC2CON0_DACPSS1_LENGTH                  equ 0001h
DAC2CON0_DACPSS1_MASK                    equ 0008h
DAC2CON0_DACOE_POSN                      equ 0005h
DAC2CON0_DACOE_POSITION                  equ 0005h
DAC2CON0_DACOE_SIZE                      equ 0001h
DAC2CON0_DACOE_LENGTH                    equ 0001h
DAC2CON0_DACOE_MASK                      equ 0020h
DAC2CON0_DAC2NSS_POSN                    equ 0000h
DAC2CON0_DAC2NSS_POSITION                equ 0000h
DAC2CON0_DAC2NSS_SIZE                    equ 0002h
DAC2CON0_DAC2NSS_LENGTH                  equ 0002h
DAC2CON0_DAC2NSS_MASK                    equ 0003h
DAC2CON0_DAC2PSS_POSN                    equ 0002h
DAC2CON0_DAC2PSS_POSITION                equ 0002h
DAC2CON0_DAC2PSS_SIZE                    equ 0002h
DAC2CON0_DAC2PSS_LENGTH                  equ 0002h
DAC2CON0_DAC2PSS_MASK                    equ 000Ch
DAC2CON0_DAC2OE1_POSN                    equ 0005h
DAC2CON0_DAC2OE1_POSITION                equ 0005h
DAC2CON0_DAC2OE1_SIZE                    equ 0001h
DAC2CON0_DAC2OE1_LENGTH                  equ 0001h
DAC2CON0_DAC2OE1_MASK                    equ 0020h
DAC2CON0_DAC2FM_POSN                     equ 0006h
DAC2CON0_DAC2FM_POSITION                 equ 0006h
DAC2CON0_DAC2FM_SIZE                     equ 0001h
DAC2CON0_DAC2FM_LENGTH                   equ 0001h
DAC2CON0_DAC2FM_MASK                     equ 0040h
DAC2CON0_DAC2EN_POSN                     equ 0007h
DAC2CON0_DAC2EN_POSITION                 equ 0007h
DAC2CON0_DAC2EN_SIZE                     equ 0001h
DAC2CON0_DAC2EN_LENGTH                   equ 0001h
DAC2CON0_DAC2EN_MASK                     equ 0080h
DAC2CON0_DAC2NSS0_POSN                   equ 0000h
DAC2CON0_DAC2NSS0_POSITION               equ 0000h
DAC2CON0_DAC2NSS0_SIZE                   equ 0001h
DAC2CON0_DAC2NSS0_LENGTH                 equ 0001h
DAC2CON0_DAC2NSS0_MASK                   equ 0001h
DAC2CON0_DAC2PSS0_POSN                   equ 0002h
DAC2CON0_DAC2PSS0_POSITION               equ 0002h
DAC2CON0_DAC2PSS0_SIZE                   equ 0001h
DAC2CON0_DAC2PSS0_LENGTH                 equ 0001h
DAC2CON0_DAC2PSS0_MASK                   equ 0004h
DAC2CON0_DAC2PSS1_POSN                   equ 0003h
DAC2CON0_DAC2PSS1_POSITION               equ 0003h
DAC2CON0_DAC2PSS1_SIZE                   equ 0001h
DAC2CON0_DAC2PSS1_LENGTH                 equ 0001h
DAC2CON0_DAC2PSS1_MASK                   equ 0008h

