GopalSaraf/Practicals/PSDL/include/proc/pic16lf1769.inc
// Register: DAC3REF
#define DAC3REF DAC3REF
DAC3REF                                  equ 0598h
// bitfield definitions
DAC3REF_DACR_POSN                        equ 0000h
DAC3REF_DACR_POSITION                    equ 0000h
DAC3REF_DACR_SIZE                        equ 0005h
DAC3REF_DACR_LENGTH                      equ 0005h
DAC3REF_DACR_MASK                        equ 001Fh
DAC3REF_DACR0_POSN                       equ 0000h
DAC3REF_DACR0_POSITION                   equ 0000h
DAC3REF_DACR0_SIZE                       equ 0001h
DAC3REF_DACR0_LENGTH                     equ 0001h
DAC3REF_DACR0_MASK                       equ 0001h
DAC3REF_DACR1_POSN                       equ 0001h
DAC3REF_DACR1_POSITION                   equ 0001h
DAC3REF_DACR1_SIZE                       equ 0001h
DAC3REF_DACR1_LENGTH                     equ 0001h
DAC3REF_DACR1_MASK                       equ 0002h
DAC3REF_DACR2_POSN                       equ 0002h
DAC3REF_DACR2_POSITION                   equ 0002h
DAC3REF_DACR2_SIZE                       equ 0001h
DAC3REF_DACR2_LENGTH                     equ 0001h
DAC3REF_DACR2_MASK                       equ 0004h
DAC3REF_DACR3_POSN                       equ 0003h
DAC3REF_DACR3_POSITION                   equ 0003h
DAC3REF_DACR3_SIZE                       equ 0001h
DAC3REF_DACR3_LENGTH                     equ 0001h
DAC3REF_DACR3_MASK                       equ 0008h
DAC3REF_DACR4_POSN                       equ 0004h
DAC3REF_DACR4_POSITION                   equ 0004h
DAC3REF_DACR4_SIZE                       equ 0001h
DAC3REF_DACR4_LENGTH                     equ 0001h
DAC3REF_DACR4_MASK                       equ 0010h
DAC3REF_R0_POSN                          equ 0000h
DAC3REF_R0_POSITION                      equ 0000h
DAC3REF_R0_SIZE                          equ 0001h
DAC3REF_R0_LENGTH                        equ 0001h
DAC3REF_R0_MASK                          equ 0001h
DAC3REF_R1_POSN                          equ 0001h
DAC3REF_R1_POSITION                      equ 0001h
DAC3REF_R1_SIZE                          equ 0001h
DAC3REF_R1_LENGTH                        equ 0001h
DAC3REF_R1_MASK                          equ 0002h
DAC3REF_R2_POSN                          equ 0002h
DAC3REF_R2_POSITION                      equ 0002h
DAC3REF_R2_SIZE                          equ 0001h
DAC3REF_R2_LENGTH                        equ 0001h
DAC3REF_R2_MASK                          equ 0004h
DAC3REF_R3_POSN                          equ 0003h
DAC3REF_R3_POSITION                      equ 0003h
DAC3REF_R3_SIZE                          equ 0001h
DAC3REF_R3_LENGTH                        equ 0001h
DAC3REF_R3_MASK                          equ 0008h
DAC3REF_R4_POSN                          equ 0004h
DAC3REF_R4_POSITION                      equ 0004h
DAC3REF_R4_SIZE                          equ 0001h
DAC3REF_R4_LENGTH                        equ 0001h
DAC3REF_R4_MASK                          equ 0010h
DAC3REF_DAC3R_POSN                       equ 0000h
DAC3REF_DAC3R_POSITION                   equ 0000h
DAC3REF_DAC3R_SIZE                       equ 0005h
DAC3REF_DAC3R_LENGTH                     equ 0005h
DAC3REF_DAC3R_MASK                       equ 001Fh
DAC3REF_DAC3R0_POSN                      equ 0000h
DAC3REF_DAC3R0_POSITION                  equ 0000h
DAC3REF_DAC3R0_SIZE                      equ 0001h
DAC3REF_DAC3R0_LENGTH                    equ 0001h
DAC3REF_DAC3R0_MASK                      equ 0001h
DAC3REF_DAC3R1_POSN                      equ 0001h
DAC3REF_DAC3R1_POSITION                  equ 0001h
DAC3REF_DAC3R1_SIZE                      equ 0001h
DAC3REF_DAC3R1_LENGTH                    equ 0001h
DAC3REF_DAC3R1_MASK                      equ 0002h
DAC3REF_DAC3R2_POSN                      equ 0002h
DAC3REF_DAC3R2_POSITION                  equ 0002h
DAC3REF_DAC3R2_SIZE                      equ 0001h
DAC3REF_DAC3R2_LENGTH                    equ 0001h
DAC3REF_DAC3R2_MASK                      equ 0004h
DAC3REF_DAC3R3_POSN                      equ 0003h
DAC3REF_DAC3R3_POSITION                  equ 0003h
DAC3REF_DAC3R3_SIZE                      equ 0001h
DAC3REF_DAC3R3_LENGTH                    equ 0001h
DAC3REF_DAC3R3_MASK                      equ 0008h
DAC3REF_DAC3R4_POSN                      equ 0004h
DAC3REF_DAC3R4_POSITION                  equ 0004h
DAC3REF_DAC3R4_SIZE                      equ 0001h
DAC3REF_DAC3R4_LENGTH                    equ 0001h
DAC3REF_DAC3R4_MASK                      equ 0010h
DAC3REF_REF0_POSN                        equ 0000h
DAC3REF_REF0_POSITION                    equ 0000h
DAC3REF_REF0_SIZE                        equ 0001h
DAC3REF_REF0_LENGTH                      equ 0001h
DAC3REF_REF0_MASK                        equ 0001h
DAC3REF_REF1_POSN                        equ 0001h
DAC3REF_REF1_POSITION                    equ 0001h
DAC3REF_REF1_SIZE                        equ 0001h
DAC3REF_REF1_LENGTH                      equ 0001h
DAC3REF_REF1_MASK                        equ 0002h
DAC3REF_REF2_POSN                        equ 0002h
DAC3REF_REF2_POSITION                    equ 0002h
DAC3REF_REF2_SIZE                        equ 0001h
DAC3REF_REF2_LENGTH                      equ 0001h
DAC3REF_REF2_MASK                        equ 0004h
DAC3REF_REF3_POSN                        equ 0003h
DAC3REF_REF3_POSITION                    equ 0003h
DAC3REF_REF3_SIZE                        equ 0001h
DAC3REF_REF3_LENGTH                      equ 0001h
DAC3REF_REF3_MASK                        equ 0008h
DAC3REF_REF4_POSN                        equ 0004h
DAC3REF_REF4_POSITION                    equ 0004h
DAC3REF_REF4_SIZE                        equ 0001h
DAC3REF_REF4_LENGTH                      equ 0001h
DAC3REF_REF4_MASK                        equ 0010h
DAC3REF_REF5_POSN                        equ 0005h
DAC3REF_REF5_POSITION                    equ 0005h
DAC3REF_REF5_SIZE                        equ 0001h
DAC3REF_REF5_LENGTH                      equ 0001h
DAC3REF_REF5_MASK                        equ 0020h
DAC3REF_DAC3REF0_POSN                    equ 0000h
DAC3REF_DAC3REF0_POSITION                equ 0000h
DAC3REF_DAC3REF0_SIZE                    equ 0001h
DAC3REF_DAC3REF0_LENGTH                  equ 0001h
DAC3REF_DAC3REF0_MASK                    equ 0001h
DAC3REF_DAC3REF1_POSN                    equ 0001h
DAC3REF_DAC3REF1_POSITION                equ 0001h
DAC3REF_DAC3REF1_SIZE                    equ 0001h
DAC3REF_DAC3REF1_LENGTH                  equ 0001h
DAC3REF_DAC3REF1_MASK                    equ 0002h
DAC3REF_DAC3REF2_POSN                    equ 0002h
DAC3REF_DAC3REF2_POSITION                equ 0002h
DAC3REF_DAC3REF2_SIZE                    equ 0001h
DAC3REF_DAC3REF2_LENGTH                  equ 0001h
DAC3REF_DAC3REF2_MASK                    equ 0004h
DAC3REF_DAC3REF3_POSN                    equ 0003h
DAC3REF_DAC3REF3_POSITION                equ 0003h
DAC3REF_DAC3REF3_SIZE                    equ 0001h
DAC3REF_DAC3REF3_LENGTH                  equ 0001h
DAC3REF_DAC3REF3_MASK                    equ 0008h
DAC3REF_DAC3REF4_POSN                    equ 0004h
DAC3REF_DAC3REF4_POSITION                equ 0004h
DAC3REF_DAC3REF4_SIZE                    equ 0001h
DAC3REF_DAC3REF4_LENGTH                  equ 0001h
DAC3REF_DAC3REF4_MASK                    equ 0010h
DAC3REF_DAC3REF5_POSN                    equ 0005h
DAC3REF_DAC3REF5_POSITION                equ 0005h
DAC3REF_DAC3REF5_SIZE                    equ 0001h
DAC3REF_DAC3REF5_LENGTH                  equ 0001h
DAC3REF_DAC3REF5_MASK                    equ 0020h

// Register: DAC4CON0
#define DAC4CON0 DAC4CON0
DAC4CON0                                 equ 0599h
// bitfield definitions
DAC4CON0_NSS_POSN                        equ 0000h
DAC4CON0_NSS_POSITION                    equ 0000h
DAC4CON0_NSS_SIZE                        equ 0001h
DAC4CON0_NSS_LENGTH                      equ 0001h
DAC4CON0_NSS_MASK                        equ 0001h
DAC4CON0_PSS_POSN                        equ 0002h
DAC4CON0_PSS_POSITION                    equ 0002h
DAC4CON0_PSS_SIZE                        equ 0002h
DAC4CON0_PSS_LENGTH                      equ 0002h
DAC4CON0_PSS_MASK                        equ 000Ch
DAC4CON0_OE1_POSN                        equ 0005h
DAC4CON0_OE1_POSITION                    equ 0005h
DAC4CON0_OE1_SIZE                        equ 0001h
DAC4CON0_OE1_LENGTH                      equ 0001h
DAC4CON0_OE1_MASK                        equ 0020h
DAC4CON0_EN_POSN                         equ 0007h
DAC4CON0_EN_POSITION                     equ 0007h
DAC4CON0_EN_SIZE                         equ 0001h
DAC4CON0_EN_LENGTH                       equ 0001h
DAC4CON0_EN_MASK                         equ 0080h
DAC4CON0_PSS0_POSN                       equ 0002h
DAC4CON0_PSS0_POSITION                   equ 0002h
DAC4CON0_PSS0_SIZE                       equ 0001h
DAC4CON0_PSS0_LENGTH                     equ 0001h
DAC4CON0_PSS0_MASK                       equ 0004h
DAC4CON0_PSS1_POSN                       equ 0003h
DAC4CON0_PSS1_POSITION                   equ 0003h
DAC4CON0_PSS1_SIZE                       equ 0001h
DAC4CON0_PSS1_LENGTH                     equ 0001h
DAC4CON0_PSS1_MASK                       equ 0008h
DAC4CON0_DACNSS_POSN                     equ 0000h
DAC4CON0_DACNSS_POSITION                 equ 0000h
DAC4CON0_DACNSS_SIZE                     equ 0001h
DAC4CON0_DACNSS_LENGTH                   equ 0001h
DAC4CON0_DACNSS_MASK                     equ 0001h
DAC4CON0_DACPSS_POSN                     equ 0002h
DAC4CON0_DACPSS_POSITION                 equ 0002h
DAC4CON0_DACPSS_SIZE                     equ 0002h
DAC4CON0_DACPSS_LENGTH                   equ 0002h
DAC4CON0_DACPSS_MASK                     equ 000Ch
DAC4CON0_DACOE1_POSN                     equ 0005h
DAC4CON0_DACOE1_POSITION                 equ 0005h
DAC4CON0_DACOE1_SIZE                     equ 0001h
DAC4CON0_DACOE1_LENGTH                   equ 0001h
DAC4CON0_DACOE1_MASK                     equ 0020h
DAC4CON0_DACEN_POSN                      equ 0007h
DAC4CON0_DACEN_POSITION                  equ 0007h
DAC4CON0_DACEN_SIZE                      equ 0001h
DAC4CON0_DACEN_LENGTH                    equ 0001h
DAC4CON0_DACEN_MASK                      equ 0080h
DAC4CON0_DACPSS0_POSN                    equ 0002h
DAC4CON0_DACPSS0_POSITION                equ 0002h
DAC4CON0_DACPSS0_SIZE                    equ 0001h
DAC4CON0_DACPSS0_LENGTH                  equ 0001h
DAC4CON0_DACPSS0_MASK                    equ 0004h
DAC4CON0_DACPSS1_POSN                    equ 0003h
DAC4CON0_DACPSS1_POSITION                equ 0003h
DAC4CON0_DACPSS1_SIZE                    equ 0001h
DAC4CON0_DACPSS1_LENGTH                  equ 0001h
DAC4CON0_DACPSS1_MASK                    equ 0008h
DAC4CON0_DAC4NSS_POSN                    equ 0000h
DAC4CON0_DAC4NSS_POSITION                equ 0000h
DAC4CON0_DAC4NSS_SIZE                    equ 0001h
DAC4CON0_DAC4NSS_LENGTH                  equ 0001h
DAC4CON0_DAC4NSS_MASK                    equ 0001h
DAC4CON0_DAC4PSS_POSN                    equ 0002h
DAC4CON0_DAC4PSS_POSITION                equ 0002h
DAC4CON0_DAC4PSS_SIZE                    equ 0002h
DAC4CON0_DAC4PSS_LENGTH                  equ 0002h
DAC4CON0_DAC4PSS_MASK                    equ 000Ch
DAC4CON0_DAC4OE1_POSN                    equ 0005h
DAC4CON0_DAC4OE1_POSITION                equ 0005h
DAC4CON0_DAC4OE1_SIZE                    equ 0001h
DAC4CON0_DAC4OE1_LENGTH                  equ 0001h
DAC4CON0_DAC4OE1_MASK                    equ 0020h
DAC4CON0_DAC4EN_POSN                     equ 0007h
DAC4CON0_DAC4EN_POSITION                 equ 0007h
DAC4CON0_DAC4EN_SIZE                     equ 0001h
DAC4CON0_DAC4EN_LENGTH                   equ 0001h
DAC4CON0_DAC4EN_MASK                     equ 0080h
DAC4CON0_DAC4PSS0_POSN                   equ 0002h
DAC4CON0_DAC4PSS0_POSITION               equ 0002h
DAC4CON0_DAC4PSS0_SIZE                   equ 0001h
DAC4CON0_DAC4PSS0_LENGTH                 equ 0001h
DAC4CON0_DAC4PSS0_MASK                   equ 0004h
DAC4CON0_DAC4PSS1_POSN                   equ 0003h
DAC4CON0_DAC4PSS1_POSITION               equ 0003h
DAC4CON0_DAC4PSS1_SIZE                   equ 0001h
DAC4CON0_DAC4PSS1_LENGTH                 equ 0001h
DAC4CON0_DAC4PSS1_MASK                   equ 0008h

// Register: DAC4REF
#define DAC4REF DAC4REF
DAC4REF                                  equ 059Ah
// bitfield definitions
DAC4REF_DACR_POSN                        equ 0000h
DAC4REF_DACR_POSITION                    equ 0000h
DAC4REF_DACR_SIZE                        equ 0005h
DAC4REF_DACR_LENGTH                      equ 0005h
DAC4REF_DACR_MASK                        equ 001Fh
DAC4REF_DACR0_POSN                       equ 0000h
DAC4REF_DACR0_POSITION                   equ 0000h
DAC4REF_DACR0_SIZE                       equ 0001h
DAC4REF_DACR0_LENGTH                     equ 0001h
DAC4REF_DACR0_MASK                       equ 0001h
DAC4REF_DACR1_POSN                       equ 0001h
DAC4REF_DACR1_POSITION                   equ 0001h
DAC4REF_DACR1_SIZE                       equ 0001h
DAC4REF_DACR1_LENGTH                     equ 0001h
DAC4REF_DACR1_MASK                       equ 0002h
DAC4REF_DACR2_POSN                       equ 0002h
DAC4REF_DACR2_POSITION                   equ 0002h
DAC4REF_DACR2_SIZE                       equ 0001h
DAC4REF_DACR2_LENGTH                     equ 0001h
DAC4REF_DACR2_MASK                       equ 0004h
DAC4REF_DACR3_POSN                       equ 0003h
DAC4REF_DACR3_POSITION                   equ 0003h
DAC4REF_DACR3_SIZE                       equ 0001h
DAC4REF_DACR3_LENGTH                     equ 0001h
DAC4REF_DACR3_MASK                       equ 0008h
DAC4REF_DACR4_POSN                       equ 0004h
DAC4REF_DACR4_POSITION                   equ 0004h
DAC4REF_DACR4_SIZE                       equ 0001h
DAC4REF_DACR4_LENGTH                     equ 0001h
DAC4REF_DACR4_MASK                       equ 0010h
DAC4REF_R0_POSN                          equ 0000h
DAC4REF_R0_POSITION                      equ 0000h
DAC4REF_R0_SIZE                          equ 0001h
DAC4REF_R0_LENGTH                        equ 0001h
DAC4REF_R0_MASK                          equ 0001h
DAC4REF_R1_POSN                          equ 0001h
DAC4REF_R1_POSITION                      equ 0001h
DAC4REF_R1_SIZE                          equ 0001h
DAC4REF_R1_LENGTH                        equ 0001h
DAC4REF_R1_MASK                          equ 0002h
DAC4REF_R2_POSN                          equ 0002h
DAC4REF_R2_POSITION                      equ 0002h
DAC4REF_R2_SIZE                          equ 0001h
DAC4REF_R2_LENGTH                        equ 0001h
DAC4REF_R2_MASK                          equ 0004h
DAC4REF_R3_POSN                          equ 0003h
DAC4REF_R3_POSITION                      equ 0003h
DAC4REF_R3_SIZE                          equ 0001h
DAC4REF_R3_LENGTH                        equ 0001h
DAC4REF_R3_MASK                          equ 0008h
DAC4REF_R4_POSN                          equ 0004h
DAC4REF_R4_POSITION                      equ 0004h
DAC4REF_R4_SIZE                          equ 0001h
DAC4REF_R4_LENGTH                        equ 0001h
DAC4REF_R4_MASK                          equ 0010h
DAC4REF_DAC4R_POSN                       equ 0000h
DAC4REF_DAC4R_POSITION                   equ 0000h
DAC4REF_DAC4R_SIZE                       equ 0005h
DAC4REF_DAC4R_LENGTH                     equ 0005h
DAC4REF_DAC4R_MASK                       equ 001Fh
DAC4REF_DAC4R0_POSN                      equ 0000h
DAC4REF_DAC4R0_POSITION                  equ 0000h
DAC4REF_DAC4R0_SIZE                      equ 0001h
DAC4REF_DAC4R0_LENGTH                    equ 0001h
DAC4REF_DAC4R0_MASK                      equ 0001h
DAC4REF_DAC4R1_POSN                      equ 0001h
DAC4REF_DAC4R1_POSITION                  equ 0001h
DAC4REF_DAC4R1_SIZE                      equ 0001h
DAC4REF_DAC4R1_LENGTH                    equ 0001h
DAC4REF_DAC4R1_MASK                      equ 0002h
DAC4REF_DAC4R2_POSN                      equ 0002h
DAC4REF_DAC4R2_POSITION                  equ 0002h
DAC4REF_DAC4R2_SIZE                      equ 0001h
DAC4REF_DAC4R2_LENGTH                    equ 0001h
DAC4REF_DAC4R2_MASK                      equ 0004h
DAC4REF_DAC4R3_POSN                      equ 0003h
DAC4REF_DAC4R3_POSITION                  equ 0003h
DAC4REF_DAC4R3_SIZE                      equ 0001h
DAC4REF_DAC4R3_LENGTH                    equ 0001h
DAC4REF_DAC4R3_MASK                      equ 0008h
DAC4REF_DAC4R4_POSN                      equ 0004h
DAC4REF_DAC4R4_POSITION                  equ 0004h
DAC4REF_DAC4R4_SIZE                      equ 0001h
DAC4REF_DAC4R4_LENGTH                    equ 0001h
DAC4REF_DAC4R4_MASK                      equ 0010h
DAC4REF_REF0_POSN                        equ 0000h
DAC4REF_REF0_POSITION                    equ 0000h
DAC4REF_REF0_SIZE                        equ 0001h
DAC4REF_REF0_LENGTH                      equ 0001h
DAC4REF_REF0_MASK                        equ 0001h
DAC4REF_REF1_POSN                        equ 0001h
DAC4REF_REF1_POSITION                    equ 0001h
DAC4REF_REF1_SIZE                        equ 0001h
DAC4REF_REF1_LENGTH                      equ 0001h
DAC4REF_REF1_MASK                        equ 0002h
DAC4REF_REF2_POSN                        equ 0002h
DAC4REF_REF2_POSITION                    equ 0002h
DAC4REF_REF2_SIZE                        equ 0001h
DAC4REF_REF2_LENGTH                      equ 0001h
DAC4REF_REF2_MASK                        equ 0004h
DAC4REF_REF3_POSN                        equ 0003h
DAC4REF_REF3_POSITION                    equ 0003h
DAC4REF_REF3_SIZE                        equ 0001h
DAC4REF_REF3_LENGTH                      equ 0001h
DAC4REF_REF3_MASK                        equ 0008h
DAC4REF_REF4_POSN                        equ 0004h
DAC4REF_REF4_POSITION                    equ 0004h
DAC4REF_REF4_SIZE                        equ 0001h
DAC4REF_REF4_LENGTH                      equ 0001h
DAC4REF_REF4_MASK                        equ 0010h
DAC4REF_REF5_POSN                        equ 0005h
DAC4REF_REF5_POSITION                    equ 0005h
DAC4REF_REF5_SIZE                        equ 0001h
DAC4REF_REF5_LENGTH                      equ 0001h
DAC4REF_REF5_MASK                        equ 0020h
DAC4REF_DAC4REF0_POSN                    equ 0000h
DAC4REF_DAC4REF0_POSITION                equ 0000h
DAC4REF_DAC4REF0_SIZE                    equ 0001h
DAC4REF_DAC4REF0_LENGTH                  equ 0001h
DAC4REF_DAC4REF0_MASK                    equ 0001h
DAC4REF_DAC4REF1_POSN                    equ 0001h
DAC4REF_DAC4REF1_POSITION                equ 0001h
DAC4REF_DAC4REF1_SIZE                    equ 0001h
DAC4REF_DAC4REF1_LENGTH                  equ 0001h
DAC4REF_DAC4REF1_MASK                    equ 0002h
DAC4REF_DAC4REF2_POSN                    equ 0002h
DAC4REF_DAC4REF2_POSITION                equ 0002h
DAC4REF_DAC4REF2_SIZE                    equ 0001h
DAC4REF_DAC4REF2_LENGTH                  equ 0001h
DAC4REF_DAC4REF2_MASK                    equ 0004h
DAC4REF_DAC4REF3_POSN                    equ 0003h
DAC4REF_DAC4REF3_POSITION                equ 0003h
DAC4REF_DAC4REF3_SIZE                    equ 0001h
DAC4REF_DAC4REF3_LENGTH                  equ 0001h
DAC4REF_DAC4REF3_MASK                    equ 0008h
DAC4REF_DAC4REF4_POSN                    equ 0004h
DAC4REF_DAC4REF4_POSITION                equ 0004h
DAC4REF_DAC4REF4_SIZE                    equ 0001h
DAC4REF_DAC4REF4_LENGTH                  equ 0001h
DAC4REF_DAC4REF4_MASK                    equ 0010h
DAC4REF_DAC4REF5_POSN                    equ 0005h
DAC4REF_DAC4REF5_POSITION                equ 0005h
DAC4REF_DAC4REF5_SIZE                    equ 0001h
DAC4REF_DAC4REF5_LENGTH                  equ 0001h
DAC4REF_DAC4REF5_MASK                    equ 0020h

