GopalSaraf/Practicals/PSDL/include/proc/pic16lf1769.inc
// Register: PRG2INS
#define PRG2INS PRG2INS
PRG2INS                                  equ 079Ch
// bitfield definitions
PRG2INS_INS_POSN                         equ 0000h
PRG2INS_INS_POSITION                     equ 0000h
PRG2INS_INS_SIZE                         equ 0008h
PRG2INS_INS_LENGTH                       equ 0008h
PRG2INS_INS_MASK                         equ 00FFh
PRG2INS_INS0_POSN                        equ 0000h
PRG2INS_INS0_POSITION                    equ 0000h
PRG2INS_INS0_SIZE                        equ 0001h
PRG2INS_INS0_LENGTH                      equ 0001h
PRG2INS_INS0_MASK                        equ 0001h
PRG2INS_INS1_POSN                        equ 0001h
PRG2INS_INS1_POSITION                    equ 0001h
PRG2INS_INS1_SIZE                        equ 0001h
PRG2INS_INS1_LENGTH                      equ 0001h
PRG2INS_INS1_MASK                        equ 0002h
PRG2INS_INS2_POSN                        equ 0002h
PRG2INS_INS2_POSITION                    equ 0002h
PRG2INS_INS2_SIZE                        equ 0001h
PRG2INS_INS2_LENGTH                      equ 0001h
PRG2INS_INS2_MASK                        equ 0004h
PRG2INS_INS3_POSN                        equ 0003h
PRG2INS_INS3_POSITION                    equ 0003h
PRG2INS_INS3_SIZE                        equ 0001h
PRG2INS_INS3_LENGTH                      equ 0001h
PRG2INS_INS3_MASK                        equ 0008h
PRG2INS_RG2INS0_POSN                     equ 0000h
PRG2INS_RG2INS0_POSITION                 equ 0000h
PRG2INS_RG2INS0_SIZE                     equ 0001h
PRG2INS_RG2INS0_LENGTH                   equ 0001h
PRG2INS_RG2INS0_MASK                     equ 0001h
PRG2INS_RG2INS1_POSN                     equ 0001h
PRG2INS_RG2INS1_POSITION                 equ 0001h
PRG2INS_RG2INS1_SIZE                     equ 0001h
PRG2INS_RG2INS1_LENGTH                   equ 0001h
PRG2INS_RG2INS1_MASK                     equ 0002h
PRG2INS_RG2INS2_POSN                     equ 0002h
PRG2INS_RG2INS2_POSITION                 equ 0002h
PRG2INS_RG2INS2_SIZE                     equ 0001h
PRG2INS_RG2INS2_LENGTH                   equ 0001h
PRG2INS_RG2INS2_MASK                     equ 0004h
PRG2INS_RG2INS3_POSN                     equ 0003h
PRG2INS_RG2INS3_POSITION                 equ 0003h
PRG2INS_RG2INS3_SIZE                     equ 0001h
PRG2INS_RG2INS3_LENGTH                   equ 0001h
PRG2INS_RG2INS3_MASK                     equ 0008h

// Register: PRG2CON0
#define PRG2CON0 PRG2CON0
PRG2CON0                                 equ 079Dh
// bitfield definitions
PRG2CON0_GO_POSN                         equ 0000h
PRG2CON0_GO_POSITION                     equ 0000h
PRG2CON0_GO_SIZE                         equ 0001h
PRG2CON0_GO_LENGTH                       equ 0001h
PRG2CON0_GO_MASK                         equ 0001h
PRG2CON0_OS_POSN                         equ 0001h
PRG2CON0_OS_POSITION                     equ 0001h
PRG2CON0_OS_SIZE                         equ 0001h
PRG2CON0_OS_LENGTH                       equ 0001h
PRG2CON0_OS_MASK                         equ 0002h
PRG2CON0_MODE_POSN                       equ 0002h
PRG2CON0_MODE_POSITION                   equ 0002h
PRG2CON0_MODE_SIZE                       equ 0002h
PRG2CON0_MODE_LENGTH                     equ 0002h
PRG2CON0_MODE_MASK                       equ 000Ch
PRG2CON0_REDG_POSN                       equ 0004h
PRG2CON0_REDG_POSITION                   equ 0004h
PRG2CON0_REDG_SIZE                       equ 0001h
PRG2CON0_REDG_LENGTH                     equ 0001h
PRG2CON0_REDG_MASK                       equ 0010h
PRG2CON0_FEDG_POSN                       equ 0005h
PRG2CON0_FEDG_POSITION                   equ 0005h
PRG2CON0_FEDG_SIZE                       equ 0001h
PRG2CON0_FEDG_LENGTH                     equ 0001h
PRG2CON0_FEDG_MASK                       equ 0020h
PRG2CON0_EN_POSN                         equ 0007h
PRG2CON0_EN_POSITION                     equ 0007h
PRG2CON0_EN_SIZE                         equ 0001h
PRG2CON0_EN_LENGTH                       equ 0001h
PRG2CON0_EN_MASK                         equ 0080h
PRG2CON0_MODE0_POSN                      equ 0002h
PRG2CON0_MODE0_POSITION                  equ 0002h
PRG2CON0_MODE0_SIZE                      equ 0001h
PRG2CON0_MODE0_LENGTH                    equ 0001h
PRG2CON0_MODE0_MASK                      equ 0004h
PRG2CON0_MODE1_POSN                      equ 0003h
PRG2CON0_MODE1_POSITION                  equ 0003h
PRG2CON0_MODE1_SIZE                      equ 0001h
PRG2CON0_MODE1_LENGTH                    equ 0001h
PRG2CON0_MODE1_MASK                      equ 0008h
PRG2CON0_RG2GO_POSN                      equ 0000h
PRG2CON0_RG2GO_POSITION                  equ 0000h
PRG2CON0_RG2GO_SIZE                      equ 0001h
PRG2CON0_RG2GO_LENGTH                    equ 0001h
PRG2CON0_RG2GO_MASK                      equ 0001h
PRG2CON0_RG2OS_POSN                      equ 0001h
PRG2CON0_RG2OS_POSITION                  equ 0001h
PRG2CON0_RG2OS_SIZE                      equ 0001h
PRG2CON0_RG2OS_LENGTH                    equ 0001h
PRG2CON0_RG2OS_MASK                      equ 0002h
PRG2CON0_RG2MODE_POSN                    equ 0002h
PRG2CON0_RG2MODE_POSITION                equ 0002h
PRG2CON0_RG2MODE_SIZE                    equ 0002h
PRG2CON0_RG2MODE_LENGTH                  equ 0002h
PRG2CON0_RG2MODE_MASK                    equ 000Ch
PRG2CON0_RG2REDG_POSN                    equ 0004h
PRG2CON0_RG2REDG_POSITION                equ 0004h
PRG2CON0_RG2REDG_SIZE                    equ 0001h
PRG2CON0_RG2REDG_LENGTH                  equ 0001h
PRG2CON0_RG2REDG_MASK                    equ 0010h
PRG2CON0_RG2FEDG_POSN                    equ 0005h
PRG2CON0_RG2FEDG_POSITION                equ 0005h
PRG2CON0_RG2FEDG_SIZE                    equ 0001h
PRG2CON0_RG2FEDG_LENGTH                  equ 0001h
PRG2CON0_RG2FEDG_MASK                    equ 0020h
PRG2CON0_RG2EN_POSN                      equ 0007h
PRG2CON0_RG2EN_POSITION                  equ 0007h
PRG2CON0_RG2EN_SIZE                      equ 0001h
PRG2CON0_RG2EN_LENGTH                    equ 0001h
PRG2CON0_RG2EN_MASK                      equ 0080h
PRG2CON0_RG2MODE0_POSN                   equ 0002h
PRG2CON0_RG2MODE0_POSITION               equ 0002h
PRG2CON0_RG2MODE0_SIZE                   equ 0001h
PRG2CON0_RG2MODE0_LENGTH                 equ 0001h
PRG2CON0_RG2MODE0_MASK                   equ 0004h
PRG2CON0_RG2MODE1_POSN                   equ 0003h
PRG2CON0_RG2MODE1_POSITION               equ 0003h
PRG2CON0_RG2MODE1_SIZE                   equ 0001h
PRG2CON0_RG2MODE1_LENGTH                 equ 0001h
PRG2CON0_RG2MODE1_MASK                   equ 0008h

// Register: PRG2CON1
#define PRG2CON1 PRG2CON1
PRG2CON1                                 equ 079Eh
// bitfield definitions
PRG2CON1_RPOL_POSN                       equ 0000h
PRG2CON1_RPOL_POSITION                   equ 0000h
PRG2CON1_RPOL_SIZE                       equ 0001h
PRG2CON1_RPOL_LENGTH                     equ 0001h
PRG2CON1_RPOL_MASK                       equ 0001h
PRG2CON1_FPOL_POSN                       equ 0001h
PRG2CON1_FPOL_POSITION                   equ 0001h
PRG2CON1_FPOL_SIZE                       equ 0001h
PRG2CON1_FPOL_LENGTH                     equ 0001h
PRG2CON1_FPOL_MASK                       equ 0002h
PRG2CON1_RDY_POSN                        equ 0002h
PRG2CON1_RDY_POSITION                    equ 0002h
PRG2CON1_RDY_SIZE                        equ 0001h
PRG2CON1_RDY_LENGTH                      equ 0001h
PRG2CON1_RDY_MASK                        equ 0004h
PRG2CON1_RG2RPOL_POSN                    equ 0000h
PRG2CON1_RG2RPOL_POSITION                equ 0000h
PRG2CON1_RG2RPOL_SIZE                    equ 0001h
PRG2CON1_RG2RPOL_LENGTH                  equ 0001h
PRG2CON1_RG2RPOL_MASK                    equ 0001h
PRG2CON1_RG2FPOL_POSN                    equ 0001h
PRG2CON1_RG2FPOL_POSITION                equ 0001h
PRG2CON1_RG2FPOL_SIZE                    equ 0001h
PRG2CON1_RG2FPOL_LENGTH                  equ 0001h
PRG2CON1_RG2FPOL_MASK                    equ 0002h
PRG2CON1_RG2RDY_POSN                     equ 0002h
PRG2CON1_RG2RDY_POSITION                 equ 0002h
PRG2CON1_RG2RDY_SIZE                     equ 0001h
PRG2CON1_RG2RDY_LENGTH                   equ 0001h
PRG2CON1_RG2RDY_MASK                     equ 0004h

// Register: PRG2CON2
#define PRG2CON2 PRG2CON2
PRG2CON2                                 equ 079Fh
// bitfield definitions
PRG2CON2_ISET_POSN                       equ 0000h
PRG2CON2_ISET_POSITION                   equ 0000h
PRG2CON2_ISET_SIZE                       equ 0005h
PRG2CON2_ISET_LENGTH                     equ 0005h
PRG2CON2_ISET_MASK                       equ 001Fh
PRG2CON2_LR_POSN                         equ 0007h
PRG2CON2_LR_POSITION                     equ 0007h
PRG2CON2_LR_SIZE                         equ 0001h
PRG2CON2_LR_LENGTH                       equ 0001h
PRG2CON2_LR_MASK                         equ 0080h
PRG2CON2_ISET0_POSN                      equ 0000h
PRG2CON2_ISET0_POSITION                  equ 0000h
PRG2CON2_ISET0_SIZE                      equ 0001h
PRG2CON2_ISET0_LENGTH                    equ 0001h
PRG2CON2_ISET0_MASK                      equ 0001h
PRG2CON2_ISET1_POSN                      equ 0001h
PRG2CON2_ISET1_POSITION                  equ 0001h
PRG2CON2_ISET1_SIZE                      equ 0001h
PRG2CON2_ISET1_LENGTH                    equ 0001h
PRG2CON2_ISET1_MASK                      equ 0002h
PRG2CON2_ISET2_POSN                      equ 0002h
PRG2CON2_ISET2_POSITION                  equ 0002h
PRG2CON2_ISET2_SIZE                      equ 0001h
PRG2CON2_ISET2_LENGTH                    equ 0001h
PRG2CON2_ISET2_MASK                      equ 0004h
PRG2CON2_ISET3_POSN                      equ 0003h
PRG2CON2_ISET3_POSITION                  equ 0003h
PRG2CON2_ISET3_SIZE                      equ 0001h
PRG2CON2_ISET3_LENGTH                    equ 0001h
PRG2CON2_ISET3_MASK                      equ 0008h
PRG2CON2_ISET4_POSN                      equ 0004h
PRG2CON2_ISET4_POSITION                  equ 0004h
PRG2CON2_ISET4_SIZE                      equ 0001h
PRG2CON2_ISET4_LENGTH                    equ 0001h
PRG2CON2_ISET4_MASK                      equ 0010h
PRG2CON2_RG2ISET_POSN                    equ 0000h
PRG2CON2_RG2ISET_POSITION                equ 0000h
PRG2CON2_RG2ISET_SIZE                    equ 0005h
PRG2CON2_RG2ISET_LENGTH                  equ 0005h
PRG2CON2_RG2ISET_MASK                    equ 001Fh
PRG2CON2_RG2ISET0_POSN                   equ 0000h
PRG2CON2_RG2ISET0_POSITION               equ 0000h
PRG2CON2_RG2ISET0_SIZE                   equ 0001h
PRG2CON2_RG2ISET0_LENGTH                 equ 0001h
PRG2CON2_RG2ISET0_MASK                   equ 0001h
PRG2CON2_RG2ISET1_POSN                   equ 0001h
PRG2CON2_RG2ISET1_POSITION               equ 0001h
PRG2CON2_RG2ISET1_SIZE                   equ 0001h
PRG2CON2_RG2ISET1_LENGTH                 equ 0001h
PRG2CON2_RG2ISET1_MASK                   equ 0002h
PRG2CON2_RG2ISET2_POSN                   equ 0002h
PRG2CON2_RG2ISET2_POSITION               equ 0002h
PRG2CON2_RG2ISET2_SIZE                   equ 0001h
PRG2CON2_RG2ISET2_LENGTH                 equ 0001h
PRG2CON2_RG2ISET2_MASK                   equ 0004h
PRG2CON2_RG2ISET3_POSN                   equ 0003h
PRG2CON2_RG2ISET3_POSITION               equ 0003h
PRG2CON2_RG2ISET3_SIZE                   equ 0001h
PRG2CON2_RG2ISET3_LENGTH                 equ 0001h
PRG2CON2_RG2ISET3_MASK                   equ 0008h
PRG2CON2_RG2ISET4_POSN                   equ 0004h
PRG2CON2_RG2ISET4_POSITION               equ 0004h
PRG2CON2_RG2ISET4_SIZE                   equ 0001h
PRG2CON2_RG2ISET4_LENGTH                 equ 0001h
PRG2CON2_RG2ISET4_MASK                   equ 0010h

// Register: PWMEN
#define PWMEN PWMEN
PWMEN                                    equ 0D8Eh
// bitfield definitions
PWMEN_MPWM5EN_POSN                       equ 0004h
PWMEN_MPWM5EN_POSITION                   equ 0004h
PWMEN_MPWM5EN_SIZE                       equ 0001h
PWMEN_MPWM5EN_LENGTH                     equ 0001h
PWMEN_MPWM5EN_MASK                       equ 0010h
PWMEN_MPWM6EN_POSN                       equ 0005h
PWMEN_MPWM6EN_POSITION                   equ 0005h
PWMEN_MPWM6EN_SIZE                       equ 0001h
PWMEN_MPWM6EN_LENGTH                     equ 0001h
PWMEN_MPWM6EN_MASK                       equ 0020h

