GopalSaraf/Practicals/PSDL/include/proc/pic16lf1769.inc
// Register: PWM5OFCON
#define PWM5OFCON PWM5OFCON
PWM5OFCON                                equ 0DA0h
// bitfield definitions
PWM5OFCON_OFS_POSN                       equ 0000h
PWM5OFCON_OFS_POSITION                   equ 0000h
PWM5OFCON_OFS_SIZE                       equ 0002h
PWM5OFCON_OFS_LENGTH                     equ 0002h
PWM5OFCON_OFS_MASK                       equ 0003h
PWM5OFCON_OFO_POSN                       equ 0004h
PWM5OFCON_OFO_POSITION                   equ 0004h
PWM5OFCON_OFO_SIZE                       equ 0001h
PWM5OFCON_OFO_LENGTH                     equ 0001h
PWM5OFCON_OFO_MASK                       equ 0010h
PWM5OFCON_OFM_POSN                       equ 0005h
PWM5OFCON_OFM_POSITION                   equ 0005h
PWM5OFCON_OFM_SIZE                       equ 0002h
PWM5OFCON_OFM_LENGTH                     equ 0002h
PWM5OFCON_OFM_MASK                       equ 0060h
PWM5OFCON_PWM5OFS0_POSN                  equ 0000h
PWM5OFCON_PWM5OFS0_POSITION              equ 0000h
PWM5OFCON_PWM5OFS0_SIZE                  equ 0001h
PWM5OFCON_PWM5OFS0_LENGTH                equ 0001h
PWM5OFCON_PWM5OFS0_MASK                  equ 0001h
PWM5OFCON_PWM5OFM0_POSN                  equ 0005h
PWM5OFCON_PWM5OFM0_POSITION              equ 0005h
PWM5OFCON_PWM5OFM0_SIZE                  equ 0001h
PWM5OFCON_PWM5OFM0_LENGTH                equ 0001h
PWM5OFCON_PWM5OFM0_MASK                  equ 0020h
PWM5OFCON_PWM5OFM1_POSN                  equ 0006h
PWM5OFCON_PWM5OFM1_POSITION              equ 0006h
PWM5OFCON_PWM5OFM1_SIZE                  equ 0001h
PWM5OFCON_PWM5OFM1_LENGTH                equ 0001h
PWM5OFCON_PWM5OFM1_MASK                  equ 0040h
PWM5OFCON_PWM5OFS_POSN                   equ 0000h
PWM5OFCON_PWM5OFS_POSITION               equ 0000h
PWM5OFCON_PWM5OFS_SIZE                   equ 0002h
PWM5OFCON_PWM5OFS_LENGTH                 equ 0002h
PWM5OFCON_PWM5OFS_MASK                   equ 0003h
PWM5OFCON_PWM5OFMC_POSN                  equ 0004h
PWM5OFCON_PWM5OFMC_POSITION              equ 0004h
PWM5OFCON_PWM5OFMC_SIZE                  equ 0001h
PWM5OFCON_PWM5OFMC_LENGTH                equ 0001h
PWM5OFCON_PWM5OFMC_MASK                  equ 0010h
PWM5OFCON_PWM5OFM_POSN                   equ 0005h
PWM5OFCON_PWM5OFM_POSITION               equ 0005h
PWM5OFCON_PWM5OFM_SIZE                   equ 0002h
PWM5OFCON_PWM5OFM_LENGTH                 equ 0002h
PWM5OFCON_PWM5OFM_MASK                   equ 0060h
PWM5OFCON_OFS0_POSN                      equ 0000h
PWM5OFCON_OFS0_POSITION                  equ 0000h
PWM5OFCON_OFS0_SIZE                      equ 0001h
PWM5OFCON_OFS0_LENGTH                    equ 0001h
PWM5OFCON_OFS0_MASK                      equ 0001h
PWM5OFCON_OFM0_POSN                      equ 0005h
PWM5OFCON_OFM0_POSITION                  equ 0005h
PWM5OFCON_OFM0_SIZE                      equ 0001h
PWM5OFCON_OFM0_LENGTH                    equ 0001h
PWM5OFCON_OFM0_MASK                      equ 0020h
PWM5OFCON_OFM1_POSN                      equ 0006h
PWM5OFCON_OFM1_POSITION                  equ 0006h
PWM5OFCON_OFM1_SIZE                      equ 0001h
PWM5OFCON_OFM1_LENGTH                    equ 0001h
PWM5OFCON_OFM1_MASK                      equ 0040h

// Register: PWM6PHL
#define PWM6PHL PWM6PHL
PWM6PHL                                  equ 0DA1h
// bitfield definitions
PWM6PHL_PH_POSN                          equ 0000h
PWM6PHL_PH_POSITION                      equ 0000h
PWM6PHL_PH_SIZE                          equ 0008h
PWM6PHL_PH_LENGTH                        equ 0008h
PWM6PHL_PH_MASK                          equ 00FFh
PWM6PHL_PWM6PHL0_POSN                    equ 0000h
PWM6PHL_PWM6PHL0_POSITION                equ 0000h
PWM6PHL_PWM6PHL0_SIZE                    equ 0001h
PWM6PHL_PWM6PHL0_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL0_MASK                    equ 0001h
PWM6PHL_PWM6PHL1_POSN                    equ 0001h
PWM6PHL_PWM6PHL1_POSITION                equ 0001h
PWM6PHL_PWM6PHL1_SIZE                    equ 0001h
PWM6PHL_PWM6PHL1_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL1_MASK                    equ 0002h
PWM6PHL_PWM6PHL2_POSN                    equ 0002h
PWM6PHL_PWM6PHL2_POSITION                equ 0002h
PWM6PHL_PWM6PHL2_SIZE                    equ 0001h
PWM6PHL_PWM6PHL2_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL2_MASK                    equ 0004h
PWM6PHL_PWM6PHL3_POSN                    equ 0003h
PWM6PHL_PWM6PHL3_POSITION                equ 0003h
PWM6PHL_PWM6PHL3_SIZE                    equ 0001h
PWM6PHL_PWM6PHL3_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL3_MASK                    equ 0008h
PWM6PHL_PWM6PHL4_POSN                    equ 0004h
PWM6PHL_PWM6PHL4_POSITION                equ 0004h
PWM6PHL_PWM6PHL4_SIZE                    equ 0001h
PWM6PHL_PWM6PHL4_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL4_MASK                    equ 0010h
PWM6PHL_PWM6PHL5_POSN                    equ 0005h
PWM6PHL_PWM6PHL5_POSITION                equ 0005h
PWM6PHL_PWM6PHL5_SIZE                    equ 0001h
PWM6PHL_PWM6PHL5_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL5_MASK                    equ 0020h
PWM6PHL_PWM6PHL6_POSN                    equ 0006h
PWM6PHL_PWM6PHL6_POSITION                equ 0006h
PWM6PHL_PWM6PHL6_SIZE                    equ 0001h
PWM6PHL_PWM6PHL6_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL6_MASK                    equ 0040h
PWM6PHL_PWM6PHL7_POSN                    equ 0007h
PWM6PHL_PWM6PHL7_POSITION                equ 0007h
PWM6PHL_PWM6PHL7_SIZE                    equ 0001h
PWM6PHL_PWM6PHL7_LENGTH                  equ 0001h
PWM6PHL_PWM6PHL7_MASK                    equ 0080h
PWM6PHL_PWM6PHL_POSN                     equ 0000h
PWM6PHL_PWM6PHL_POSITION                 equ 0000h
PWM6PHL_PWM6PHL_SIZE                     equ 0008h
PWM6PHL_PWM6PHL_LENGTH                   equ 0008h
PWM6PHL_PWM6PHL_MASK                     equ 00FFh

// Register: PWM6PHH
#define PWM6PHH PWM6PHH
PWM6PHH                                  equ 0DA2h
// bitfield definitions
PWM6PHH_PH_POSN                          equ 0000h
PWM6PHH_PH_POSITION                      equ 0000h
PWM6PHH_PH_SIZE                          equ 0008h
PWM6PHH_PH_LENGTH                        equ 0008h
PWM6PHH_PH_MASK                          equ 00FFh
PWM6PHH_PWM6PHH0_POSN                    equ 0000h
PWM6PHH_PWM6PHH0_POSITION                equ 0000h
PWM6PHH_PWM6PHH0_SIZE                    equ 0001h
PWM6PHH_PWM6PHH0_LENGTH                  equ 0001h
PWM6PHH_PWM6PHH0_MASK                    equ 0001h
PWM6PHH_PWM6PHH1_POSN                    equ 0001h
PWM6PHH_PWM6PHH1_POSITION                equ 0001h
PWM6PHH_PWM6PHH1_SIZE                    equ 0001h
PWM6PHH_PWM6PHH1_LENGTH                  equ 0001h
PWM6PHH_PWM6PHH1_MASK                    equ 0002h
PWM6PHH_PWM6PHH2_POSN                    equ 0002h
PWM6PHH_PWM6PHH2_POSITION                equ 0002h
PWM6PHH_PWM6PHH2_SIZE                    equ 0001h
PWM6PHH_PWM6PHH2_LENGTH                  equ 0001h
PWM6PHH_PWM6PHH2_MASK                    equ 0004h
PWM6PHH_PWM6PHH3_POSN                    equ 0003h
PWM6PHH_PWM6PHH3_POSITION                equ 0003h
PWM6PHH_PWM6PHH3_SIZE                    equ 0001h
PWM6PHH_PWM6PHH3_LENGTH                  equ 0001h
PWM6PHH_PWM6PHH3_MASK                    equ 0008h
PWM6PHH_PWM6PHH4_POSN                    equ 0004h
PWM6PHH_PWM6PHH4_POSITION                equ 0004h
PWM6PHH_PWM6PHH4_SIZE                    equ 0001h
PWM6PHH_PWM6PHH4_LENGTH                  equ 0001h
PWM6PHH_PWM6PHH4_MASK                    equ 0010h
PWM6PHH_PWM6PHH5_POSN                    equ 0005h
PWM6PHH_PWM6PHH5_POSITION                equ 0005h
PWM6PHH_PWM6PHH5_SIZE                    equ 0001h
PWM6PHH_PWM6PHH5_LENGTH                  equ 0001h
PWM6PHH_PWM6PHH5_MASK                    equ 0020h
PWM6PHH_PWM6PHH6_POSN                    equ 0006h
PWM6PHH_PWM6PHH6_POSITION                equ 0006h
PWM6PHH_PWM6PHH6_SIZE                    equ 0001h
PWM6PHH_PWM6PHH6_LENGTH                  equ 0001h
PWM6PHH_PWM6PHH6_MASK                    equ 0040h
PWM6PHH_PWM6PHH7_POSN                    equ 0007h
PWM6PHH_PWM6PHH7_POSITION                equ 0007h
PWM6PHH_PWM6PHH7_SIZE                    equ 0001h
PWM6PHH_PWM6PHH7_LENGTH                  equ 0001h
PWM6PHH_PWM6PHH7_MASK                    equ 0080h
PWM6PHH_PWM6PHH_POSN                     equ 0000h
PWM6PHH_PWM6PHH_POSITION                 equ 0000h
PWM6PHH_PWM6PHH_SIZE                     equ 0008h
PWM6PHH_PWM6PHH_LENGTH                   equ 0008h
PWM6PHH_PWM6PHH_MASK                     equ 00FFh

// Register: PWM6DCL
#define PWM6DCL PWM6DCL
PWM6DCL                                  equ 0DA3h
// bitfield definitions
PWM6DCL_DC_POSN                          equ 0000h
PWM6DCL_DC_POSITION                      equ 0000h
PWM6DCL_DC_SIZE                          equ 0008h
PWM6DCL_DC_LENGTH                        equ 0008h
PWM6DCL_DC_MASK                          equ 00FFh
PWM6DCL_PWM6DCL0_POSN                    equ 0000h
PWM6DCL_PWM6DCL0_POSITION                equ 0000h
PWM6DCL_PWM6DCL0_SIZE                    equ 0001h
PWM6DCL_PWM6DCL0_LENGTH                  equ 0001h
PWM6DCL_PWM6DCL0_MASK                    equ 0001h
PWM6DCL_PWM6DCL1_POSN                    equ 0001h
PWM6DCL_PWM6DCL1_POSITION                equ 0001h
PWM6DCL_PWM6DCL1_SIZE                    equ 0001h
PWM6DCL_PWM6DCL1_LENGTH                  equ 0001h
PWM6DCL_PWM6DCL1_MASK                    equ 0002h
PWM6DCL_PWM6DCL2_POSN                    equ 0002h
PWM6DCL_PWM6DCL2_POSITION                equ 0002h
PWM6DCL_PWM6DCL2_SIZE                    equ 0001h
PWM6DCL_PWM6DCL2_LENGTH                  equ 0001h
PWM6DCL_PWM6DCL2_MASK                    equ 0004h
PWM6DCL_PWM6DCL3_POSN                    equ 0003h
PWM6DCL_PWM6DCL3_POSITION                equ 0003h
PWM6DCL_PWM6DCL3_SIZE                    equ 0001h
PWM6DCL_PWM6DCL3_LENGTH                  equ 0001h
PWM6DCL_PWM6DCL3_MASK                    equ 0008h
PWM6DCL_PWM6DCL4_POSN                    equ 0004h
PWM6DCL_PWM6DCL4_POSITION                equ 0004h
PWM6DCL_PWM6DCL4_SIZE                    equ 0001h
PWM6DCL_PWM6DCL4_LENGTH                  equ 0001h
PWM6DCL_PWM6DCL4_MASK                    equ 0010h
PWM6DCL_PWM6DCL5_POSN                    equ 0005h
PWM6DCL_PWM6DCL5_POSITION                equ 0005h
PWM6DCL_PWM6DCL5_SIZE                    equ 0001h
PWM6DCL_PWM6DCL5_LENGTH                  equ 0001h
PWM6DCL_PWM6DCL5_MASK                    equ 0020h
PWM6DCL_PWM6DCL6_POSN                    equ 0006h
PWM6DCL_PWM6DCL6_POSITION                equ 0006h
PWM6DCL_PWM6DCL6_SIZE                    equ 0001h
PWM6DCL_PWM6DCL6_LENGTH                  equ 0001h
PWM6DCL_PWM6DCL6_MASK                    equ 0040h
PWM6DCL_PWM6DCL7_POSN                    equ 0007h
PWM6DCL_PWM6DCL7_POSITION                equ 0007h
PWM6DCL_PWM6DCL7_SIZE                    equ 0001h
PWM6DCL_PWM6DCL7_LENGTH                  equ 0001h
PWM6DCL_PWM6DCL7_MASK                    equ 0080h
PWM6DCL_PWM6DCL_POSN                     equ 0000h
PWM6DCL_PWM6DCL_POSITION                 equ 0000h
PWM6DCL_PWM6DCL_SIZE                     equ 0008h
PWM6DCL_PWM6DCL_LENGTH                   equ 0008h
PWM6DCL_PWM6DCL_MASK                     equ 00FFh

// Register: PWM6DCH
#define PWM6DCH PWM6DCH
PWM6DCH                                  equ 0DA4h
// bitfield definitions
PWM6DCH_DC_POSN                          equ 0000h
PWM6DCH_DC_POSITION                      equ 0000h
PWM6DCH_DC_SIZE                          equ 0008h
PWM6DCH_DC_LENGTH                        equ 0008h
PWM6DCH_DC_MASK                          equ 00FFh
PWM6DCH_PWM6DCH0_POSN                    equ 0000h
PWM6DCH_PWM6DCH0_POSITION                equ 0000h
PWM6DCH_PWM6DCH0_SIZE                    equ 0001h
PWM6DCH_PWM6DCH0_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH0_MASK                    equ 0001h
PWM6DCH_PWM6DCH1_POSN                    equ 0001h
PWM6DCH_PWM6DCH1_POSITION                equ 0001h
PWM6DCH_PWM6DCH1_SIZE                    equ 0001h
PWM6DCH_PWM6DCH1_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH1_MASK                    equ 0002h
PWM6DCH_PWM6DCH2_POSN                    equ 0002h
PWM6DCH_PWM6DCH2_POSITION                equ 0002h
PWM6DCH_PWM6DCH2_SIZE                    equ 0001h
PWM6DCH_PWM6DCH2_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH2_MASK                    equ 0004h
PWM6DCH_PWM6DCH3_POSN                    equ 0003h
PWM6DCH_PWM6DCH3_POSITION                equ 0003h
PWM6DCH_PWM6DCH3_SIZE                    equ 0001h
PWM6DCH_PWM6DCH3_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH3_MASK                    equ 0008h
PWM6DCH_PWM6DCH4_POSN                    equ 0004h
PWM6DCH_PWM6DCH4_POSITION                equ 0004h
PWM6DCH_PWM6DCH4_SIZE                    equ 0001h
PWM6DCH_PWM6DCH4_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH4_MASK                    equ 0010h
PWM6DCH_PWM6DCH5_POSN                    equ 0005h
PWM6DCH_PWM6DCH5_POSITION                equ 0005h
PWM6DCH_PWM6DCH5_SIZE                    equ 0001h
PWM6DCH_PWM6DCH5_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH5_MASK                    equ 0020h
PWM6DCH_PWM6DCH6_POSN                    equ 0006h
PWM6DCH_PWM6DCH6_POSITION                equ 0006h
PWM6DCH_PWM6DCH6_SIZE                    equ 0001h
PWM6DCH_PWM6DCH6_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH6_MASK                    equ 0040h
PWM6DCH_PWM6DCH7_POSN                    equ 0007h
PWM6DCH_PWM6DCH7_POSITION                equ 0007h
PWM6DCH_PWM6DCH7_SIZE                    equ 0001h
PWM6DCH_PWM6DCH7_LENGTH                  equ 0001h
PWM6DCH_PWM6DCH7_MASK                    equ 0080h
PWM6DCH_PWM6DCH_POSN                     equ 0000h
PWM6DCH_PWM6DCH_POSITION                 equ 0000h
PWM6DCH_PWM6DCH_SIZE                     equ 0008h
PWM6DCH_PWM6DCH_LENGTH                   equ 0008h
PWM6DCH_PWM6DCH_MASK                     equ 00FFh

// Register: PWM6PRL
#define PWM6PRL PWM6PRL
PWM6PRL                                  equ 0DA5h
// bitfield definitions
PWM6PRL_PR_POSN                          equ 0000h
PWM6PRL_PR_POSITION                      equ 0000h
PWM6PRL_PR_SIZE                          equ 0008h
PWM6PRL_PR_LENGTH                        equ 0008h
PWM6PRL_PR_MASK                          equ 00FFh
PWM6PRL_PWM6PRL0_POSN                    equ 0000h
PWM6PRL_PWM6PRL0_POSITION                equ 0000h
PWM6PRL_PWM6PRL0_SIZE                    equ 0001h
PWM6PRL_PWM6PRL0_LENGTH                  equ 0001h
PWM6PRL_PWM6PRL0_MASK                    equ 0001h
PWM6PRL_PWM6PRL1_POSN                    equ 0001h
PWM6PRL_PWM6PRL1_POSITION                equ 0001h
PWM6PRL_PWM6PRL1_SIZE                    equ 0001h
PWM6PRL_PWM6PRL1_LENGTH                  equ 0001h
PWM6PRL_PWM6PRL1_MASK                    equ 0002h
PWM6PRL_PWM6PRL2_POSN                    equ 0002h
PWM6PRL_PWM6PRL2_POSITION                equ 0002h
PWM6PRL_PWM6PRL2_SIZE                    equ 0001h
PWM6PRL_PWM6PRL2_LENGTH                  equ 0001h
PWM6PRL_PWM6PRL2_MASK                    equ 0004h
PWM6PRL_PWM6PRL3_POSN                    equ 0003h
PWM6PRL_PWM6PRL3_POSITION                equ 0003h
PWM6PRL_PWM6PRL3_SIZE                    equ 0001h
PWM6PRL_PWM6PRL3_LENGTH                  equ 0001h
PWM6PRL_PWM6PRL3_MASK                    equ 0008h
PWM6PRL_PWM6PRL4_POSN                    equ 0004h
PWM6PRL_PWM6PRL4_POSITION                equ 0004h
PWM6PRL_PWM6PRL4_SIZE                    equ 0001h
PWM6PRL_PWM6PRL4_LENGTH                  equ 0001h
PWM6PRL_PWM6PRL4_MASK                    equ 0010h
PWM6PRL_PWM6PRL5_POSN                    equ 0005h
PWM6PRL_PWM6PRL5_POSITION                equ 0005h
PWM6PRL_PWM6PRL5_SIZE                    equ 0001h
PWM6PRL_PWM6PRL5_LENGTH                  equ 0001h
PWM6PRL_PWM6PRL5_MASK                    equ 0020h
PWM6PRL_PWM6PRL6_POSN                    equ 0006h
PWM6PRL_PWM6PRL6_POSITION                equ 0006h
PWM6PRL_PWM6PRL6_SIZE                    equ 0001h
PWM6PRL_PWM6PRL6_LENGTH                  equ 0001h
PWM6PRL_PWM6PRL6_MASK                    equ 0040h
PWM6PRL_PWM6PRL7_POSN                    equ 0007h
PWM6PRL_PWM6PRL7_POSITION                equ 0007h
PWM6PRL_PWM6PRL7_SIZE                    equ 0001h
PWM6PRL_PWM6PRL7_LENGTH                  equ 0001h
PWM6PRL_PWM6PRL7_MASK                    equ 0080h
PWM6PRL_PWM6PRL_POSN                     equ 0000h
PWM6PRL_PWM6PRL_POSITION                 equ 0000h
PWM6PRL_PWM6PRL_SIZE                     equ 0008h
PWM6PRL_PWM6PRL_LENGTH                   equ 0008h
PWM6PRL_PWM6PRL_MASK                     equ 00FFh

// Register: PWM6PRH
#define PWM6PRH PWM6PRH
PWM6PRH                                  equ 0DA6h
// bitfield definitions
PWM6PRH_PR_POSN                          equ 0000h
PWM6PRH_PR_POSITION                      equ 0000h
PWM6PRH_PR_SIZE                          equ 0008h
PWM6PRH_PR_LENGTH                        equ 0008h
PWM6PRH_PR_MASK                          equ 00FFh
PWM6PRH_PWM6PRH0_POSN                    equ 0000h
PWM6PRH_PWM6PRH0_POSITION                equ 0000h
PWM6PRH_PWM6PRH0_SIZE                    equ 0001h
PWM6PRH_PWM6PRH0_LENGTH                  equ 0001h
PWM6PRH_PWM6PRH0_MASK                    equ 0001h
PWM6PRH_PWM6PRH1_POSN                    equ 0001h
PWM6PRH_PWM6PRH1_POSITION                equ 0001h
PWM6PRH_PWM6PRH1_SIZE                    equ 0001h
PWM6PRH_PWM6PRH1_LENGTH                  equ 0001h
PWM6PRH_PWM6PRH1_MASK                    equ 0002h
PWM6PRH_PWM6PRH2_POSN                    equ 0002h
PWM6PRH_PWM6PRH2_POSITION                equ 0002h
PWM6PRH_PWM6PRH2_SIZE                    equ 0001h
PWM6PRH_PWM6PRH2_LENGTH                  equ 0001h
PWM6PRH_PWM6PRH2_MASK                    equ 0004h
PWM6PRH_PWM6PRH3_POSN                    equ 0003h
PWM6PRH_PWM6PRH3_POSITION                equ 0003h
PWM6PRH_PWM6PRH3_SIZE                    equ 0001h
PWM6PRH_PWM6PRH3_LENGTH                  equ 0001h
PWM6PRH_PWM6PRH3_MASK                    equ 0008h
PWM6PRH_PWM6PRH4_POSN                    equ 0004h
PWM6PRH_PWM6PRH4_POSITION                equ 0004h
PWM6PRH_PWM6PRH4_SIZE                    equ 0001h
PWM6PRH_PWM6PRH4_LENGTH                  equ 0001h
PWM6PRH_PWM6PRH4_MASK                    equ 0010h
PWM6PRH_PWM6PRH5_POSN                    equ 0005h
PWM6PRH_PWM6PRH5_POSITION                equ 0005h
PWM6PRH_PWM6PRH5_SIZE                    equ 0001h
PWM6PRH_PWM6PRH5_LENGTH                  equ 0001h
PWM6PRH_PWM6PRH5_MASK                    equ 0020h
PWM6PRH_PWM6PRH6_POSN                    equ 0006h
PWM6PRH_PWM6PRH6_POSITION                equ 0006h
PWM6PRH_PWM6PRH6_SIZE                    equ 0001h
PWM6PRH_PWM6PRH6_LENGTH                  equ 0001h
PWM6PRH_PWM6PRH6_MASK                    equ 0040h
PWM6PRH_PWM6PRH7_POSN                    equ 0007h
PWM6PRH_PWM6PRH7_POSITION                equ 0007h
PWM6PRH_PWM6PRH7_SIZE                    equ 0001h
PWM6PRH_PWM6PRH7_LENGTH                  equ 0001h
PWM6PRH_PWM6PRH7_MASK                    equ 0080h
PWM6PRH_PWM6PRH_POSN                     equ 0000h
PWM6PRH_PWM6PRH_POSITION                 equ 0000h
PWM6PRH_PWM6PRH_SIZE                     equ 0008h
PWM6PRH_PWM6PRH_LENGTH                   equ 0008h
PWM6PRH_PWM6PRH_MASK                     equ 00FFh

// Register: PWM6OFL
#define PWM6OFL PWM6OFL
PWM6OFL                                  equ 0DA7h
// bitfield definitions
PWM6OFL_OF_POSN                          equ 0000h
PWM6OFL_OF_POSITION                      equ 0000h
PWM6OFL_OF_SIZE                          equ 0008h
PWM6OFL_OF_LENGTH                        equ 0008h
PWM6OFL_OF_MASK                          equ 00FFh
PWM6OFL_PWM6OFL0_POSN                    equ 0000h
PWM6OFL_PWM6OFL0_POSITION                equ 0000h
PWM6OFL_PWM6OFL0_SIZE                    equ 0001h
PWM6OFL_PWM6OFL0_LENGTH                  equ 0001h
PWM6OFL_PWM6OFL0_MASK                    equ 0001h
PWM6OFL_PWM6OFL1_POSN                    equ 0001h
PWM6OFL_PWM6OFL1_POSITION                equ 0001h
PWM6OFL_PWM6OFL1_SIZE                    equ 0001h
PWM6OFL_PWM6OFL1_LENGTH                  equ 0001h
PWM6OFL_PWM6OFL1_MASK                    equ 0002h
PWM6OFL_PWM6OFL2_POSN                    equ 0002h
PWM6OFL_PWM6OFL2_POSITION                equ 0002h
PWM6OFL_PWM6OFL2_SIZE                    equ 0001h
PWM6OFL_PWM6OFL2_LENGTH                  equ 0001h
PWM6OFL_PWM6OFL2_MASK                    equ 0004h
PWM6OFL_PWM6OFL3_POSN                    equ 0003h
PWM6OFL_PWM6OFL3_POSITION                equ 0003h
PWM6OFL_PWM6OFL3_SIZE                    equ 0001h
PWM6OFL_PWM6OFL3_LENGTH                  equ 0001h
PWM6OFL_PWM6OFL3_MASK                    equ 0008h
PWM6OFL_PWM6OFL4_POSN                    equ 0004h
PWM6OFL_PWM6OFL4_POSITION                equ 0004h
PWM6OFL_PWM6OFL4_SIZE                    equ 0001h
PWM6OFL_PWM6OFL4_LENGTH                  equ 0001h
PWM6OFL_PWM6OFL4_MASK                    equ 0010h
PWM6OFL_PWM6OFL5_POSN                    equ 0005h
PWM6OFL_PWM6OFL5_POSITION                equ 0005h
PWM6OFL_PWM6OFL5_SIZE                    equ 0001h
PWM6OFL_PWM6OFL5_LENGTH                  equ 0001h
PWM6OFL_PWM6OFL5_MASK                    equ 0020h
PWM6OFL_PWM6OFL6_POSN                    equ 0006h
PWM6OFL_PWM6OFL6_POSITION                equ 0006h
PWM6OFL_PWM6OFL6_SIZE                    equ 0001h
PWM6OFL_PWM6OFL6_LENGTH                  equ 0001h
PWM6OFL_PWM6OFL6_MASK                    equ 0040h
PWM6OFL_PWM6OFL7_POSN                    equ 0007h
PWM6OFL_PWM6OFL7_POSITION                equ 0007h
PWM6OFL_PWM6OFL7_SIZE                    equ 0001h
PWM6OFL_PWM6OFL7_LENGTH                  equ 0001h
PWM6OFL_PWM6OFL7_MASK                    equ 0080h
PWM6OFL_PWM6OFL_POSN                     equ 0000h
PWM6OFL_PWM6OFL_POSITION                 equ 0000h
PWM6OFL_PWM6OFL_SIZE                     equ 0008h
PWM6OFL_PWM6OFL_LENGTH                   equ 0008h
PWM6OFL_PWM6OFL_MASK                     equ 00FFh

