GopalSaraf/Practicals/PSDL/include/proc/pic16lf1769.inc
#define G1FSIM6                          BANKMASK(COG1FSIM0), 6
#define G1FSIM7                          BANKMASK(COG1FSIM0), 7
#define G1FSIM8                          BANKMASK(COG1FSIM1), 0
#define G1FSIM9                          BANKMASK(COG1FSIM1), 1
#define G1LD                             BANKMASK(COG1CON0), 6
#define G1MD0                            BANKMASK(COG1CON0), 0
#define G1MD1                            BANKMASK(COG1CON0), 1
#define G1MD2                            BANKMASK(COG1CON0), 2
#define G1PHF0                           BANKMASK(COG1PHF), 0
#define G1PHF1                           BANKMASK(COG1PHF), 1
#define G1PHF2                           BANKMASK(COG1PHF), 2
#define G1PHF3                           BANKMASK(COG1PHF), 3
#define G1PHF4                           BANKMASK(COG1PHF), 4
#define G1PHF5                           BANKMASK(COG1PHF), 5
#define G1PHR0                           BANKMASK(COG1PHR), 0
#define G1PHR1                           BANKMASK(COG1PHR), 1
#define G1PHR2                           BANKMASK(COG1PHR), 2
#define G1PHR3                           BANKMASK(COG1PHR), 3
#define G1PHR4                           BANKMASK(COG1PHR), 4
#define G1PHR5                           BANKMASK(COG1PHR), 5
#define G1POLA                           BANKMASK(COG1CON1), 0
#define G1POLB                           BANKMASK(COG1CON1), 1
#define G1POLC                           BANKMASK(COG1CON1), 2
#define G1POLD                           BANKMASK(COG1CON1), 3
#define G1RDBS                           BANKMASK(COG1CON1), 7
#define G1RIS0                           BANKMASK(COG1RIS0), 0
#define G1RIS1                           BANKMASK(COG1RIS0), 1
#define G1RIS10                          BANKMASK(COG1RIS1), 2
#define G1RIS11                          BANKMASK(COG1RIS1), 3
#define G1RIS12                          BANKMASK(COG1RIS1), 4
#define G1RIS13                          BANKMASK(COG1RIS1), 5
#define G1RIS14                          BANKMASK(COG1RIS1), 6
#define G1RIS15                          BANKMASK(COG1RIS1), 7
#define G1RIS2                           BANKMASK(COG1RIS0), 2
#define G1RIS3                           BANKMASK(COG1RIS0), 3
#define G1RIS4                           BANKMASK(COG1RIS0), 4
#define G1RIS5                           BANKMASK(COG1RIS0), 5
#define G1RIS6                           BANKMASK(COG1RIS0), 6
#define G1RIS7                           BANKMASK(COG1RIS0), 7
#define G1RIS8                           BANKMASK(COG1RIS1), 0
#define G1RIS9                           BANKMASK(COG1RIS1), 1
#define G1RSIM0                          BANKMASK(COG1RSIM0), 0
#define G1RSIM1                          BANKMASK(COG1RSIM0), 1
#define G1RSIM10                         BANKMASK(COG1RSIM1), 2
#define G1RSIM11                         BANKMASK(COG1RSIM1), 3
#define G1RSIM12                         BANKMASK(COG1RSIM1), 4
#define G1RSIM13                         BANKMASK(COG1RSIM1), 5
#define G1RSIM14                         BANKMASK(COG1RSIM1), 6
#define G1RSIM15                         BANKMASK(COG1RSIM1), 7
#define G1RSIM2                          BANKMASK(COG1RSIM0), 2
#define G1RSIM3                          BANKMASK(COG1RSIM0), 3
#define G1RSIM4                          BANKMASK(COG1RSIM0), 4
#define G1RSIM5                          BANKMASK(COG1RSIM0), 5
#define G1RSIM6                          BANKMASK(COG1RSIM0), 6
#define G1RSIM7                          BANKMASK(COG1RSIM0), 7
#define G1RSIM8                          BANKMASK(COG1RSIM1), 0
#define G1RSIM9                          BANKMASK(COG1RSIM1), 1
#define G1SDATA                          BANKMASK(COG1STR), 4
#define G1SDATB                          BANKMASK(COG1STR), 5
#define G1SDATC                          BANKMASK(COG1STR), 6
#define G1SDATD                          BANKMASK(COG1STR), 7
#define G1STRA                           BANKMASK(COG1STR), 0
#define G1STRB                           BANKMASK(COG1STR), 1
#define G1STRC                           BANKMASK(COG1STR), 2
#define G1STRD                           BANKMASK(COG1STR), 3
#define G2ARSEN                          BANKMASK(COG2ASD0), 6
#define G2AS0E                           BANKMASK(COG2ASD1), 0
#define G2AS1E                           BANKMASK(COG2ASD1), 1
#define G2AS2E                           BANKMASK(COG2ASD1), 2
#define G2AS3E                           BANKMASK(COG2ASD1), 3
#define G2AS4E                           BANKMASK(COG2ASD1), 4
#define G2AS5E                           BANKMASK(COG2ASD1), 5
#define G2AS6E                           BANKMASK(COG2ASD1), 6
#define G2AS7E                           BANKMASK(COG2ASD1), 7
#define G2ASDAC0                         BANKMASK(COG2ASD0), 2
#define G2ASDAC1                         BANKMASK(COG2ASD0), 3
#define G2ASDBD0                         BANKMASK(COG2ASD0), 4
#define G2ASDBD1                         BANKMASK(COG2ASD0), 5
#define G2ASE                            BANKMASK(COG2ASD0), 7
#define G2ASREN                          BANKMASK(COG2ASD0), 6
#define G2BLKF0                          BANKMASK(COG2BLKF), 0
#define G2BLKF1                          BANKMASK(COG2BLKF), 1
#define G2BLKF2                          BANKMASK(COG2BLKF), 2
#define G2BLKF3                          BANKMASK(COG2BLKF), 3
#define G2BLKF4                          BANKMASK(COG2BLKF), 4
#define G2BLKF5                          BANKMASK(COG2BLKF), 5
#define G2BLKR0                          BANKMASK(COG2BLKR), 0
#define G2BLKR1                          BANKMASK(COG2BLKR), 1
#define G2BLKR2                          BANKMASK(COG2BLKR), 2
#define G2BLKR3                          BANKMASK(COG2BLKR), 3
#define G2BLKR4                          BANKMASK(COG2BLKR), 4
#define G2BLKR5                          BANKMASK(COG2BLKR), 5
#define G2CS0                            BANKMASK(COG2CON0), 3
#define G2CS1                            BANKMASK(COG2CON0), 4
#define G2DBF0                           BANKMASK(COG2DBF), 0
#define G2DBF1                           BANKMASK(COG2DBF), 1
#define G2DBF2                           BANKMASK(COG2DBF), 2
#define G2DBF3                           BANKMASK(COG2DBF), 3
#define G2DBF4                           BANKMASK(COG2DBF), 4
#define G2DBF5                           BANKMASK(COG2DBF), 5
#define G2DBR0                           BANKMASK(COG2DBR), 0
#define G2DBR1                           BANKMASK(COG2DBR), 1
#define G2DBR2                           BANKMASK(COG2DBR), 2
#define G2DBR3                           BANKMASK(COG2DBR), 3
#define G2DBR4                           BANKMASK(COG2DBR), 4
#define G2DBR5                           BANKMASK(COG2DBR), 5
#define G2EN                             BANKMASK(COG2CON0), 7
#define G2FDBS                           BANKMASK(COG2CON1), 6
#define G2FIS0                           BANKMASK(COG2FIS0), 0
#define G2FIS1                           BANKMASK(COG2FIS0), 1
#define G2FIS10                          BANKMASK(COG2FIS1), 2
#define G2FIS11                          BANKMASK(COG2FIS1), 3
#define G2FIS12                          BANKMASK(COG2FIS1), 4
#define G2FIS13                          BANKMASK(COG2FIS1), 5
#define G2FIS14                          BANKMASK(COG2FIS1), 6
#define G2FIS15                          BANKMASK(COG2FIS1), 7
#define G2FIS2                           BANKMASK(COG2FIS0), 2
#define G2FIS3                           BANKMASK(COG2FIS0), 3
#define G2FIS4                           BANKMASK(COG2FIS0), 4
#define G2FIS5                           BANKMASK(COG2FIS0), 5
#define G2FIS6                           BANKMASK(COG2FIS0), 6
#define G2FIS7                           BANKMASK(COG2FIS0), 7
#define G2FIS8                           BANKMASK(COG2FIS1), 0
#define G2FIS9                           BANKMASK(COG2FIS1), 1
#define G2FSIM0                          BANKMASK(COG2FSIM0), 0
#define G2FSIM1                          BANKMASK(COG2FSIM0), 1
#define G2FSIM10                         BANKMASK(COG2FSIM1), 2
#define G2FSIM11                         BANKMASK(COG2FSIM1), 3
#define G2FSIM12                         BANKMASK(COG2FSIM1), 4
#define G2FSIM13                         BANKMASK(COG2FSIM1), 5
#define G2FSIM14                         BANKMASK(COG2FSIM1), 6
#define G2FSIM15                         BANKMASK(COG2FSIM1), 7
#define G2FSIM2                          BANKMASK(COG2FSIM0), 2
#define G2FSIM3                          BANKMASK(COG2FSIM0), 3
#define G2FSIM4                          BANKMASK(COG2FSIM0), 4
#define G2FSIM5                          BANKMASK(COG2FSIM0), 5
#define G2FSIM6                          BANKMASK(COG2FSIM0), 6
#define G2FSIM7                          BANKMASK(COG2FSIM0), 7
#define G2FSIM8                          BANKMASK(COG2FSIM1), 0
#define G2FSIM9                          BANKMASK(COG2FSIM1), 1
#define G2LD                             BANKMASK(COG2CON0), 6
#define G2MD0                            BANKMASK(COG2CON0), 0
#define G2MD1                            BANKMASK(COG2CON0), 1
#define G2MD2                            BANKMASK(COG2CON0), 2
#define G2PHF0                           BANKMASK(COG2PHF), 0
#define G2PHF1                           BANKMASK(COG2PHF), 1
#define G2PHF2                           BANKMASK(COG2PHF), 2
#define G2PHF3                           BANKMASK(COG2PHF), 3
#define G2PHF4                           BANKMASK(COG2PHF), 4
#define G2PHF5                           BANKMASK(COG2PHF), 5
#define G2PHR0                           BANKMASK(COG2PHR), 0
#define G2PHR1                           BANKMASK(COG2PHR), 1
#define G2PHR2                           BANKMASK(COG2PHR), 2
#define G2PHR3                           BANKMASK(COG2PHR), 3
#define G2PHR4                           BANKMASK(COG2PHR), 4
#define G2PHR5                           BANKMASK(COG2PHR), 5
#define G2POLA                           BANKMASK(COG2CON1), 0
#define G2POLB                           BANKMASK(COG2CON1), 1
#define G2POLC                           BANKMASK(COG2CON1), 2
#define G2POLD                           BANKMASK(COG2CON1), 3
#define G2RDBS                           BANKMASK(COG2CON1), 7
#define G2RIS0                           BANKMASK(COG2RIS0), 0
#define G2RIS1                           BANKMASK(COG2RIS0), 1
#define G2RIS10                          BANKMASK(COG2RIS1), 2
#define G2RIS11                          BANKMASK(COG2RIS1), 3
#define G2RIS12                          BANKMASK(COG2RIS1), 4
#define G2RIS13                          BANKMASK(COG2RIS1), 5
#define G2RIS14                          BANKMASK(COG2RIS1), 6
#define G2RIS15                          BANKMASK(COG2RIS1), 7
#define G2RIS2                           BANKMASK(COG2RIS0), 2
#define G2RIS3                           BANKMASK(COG2RIS0), 3
#define G2RIS4                           BANKMASK(COG2RIS0), 4
#define G2RIS5                           BANKMASK(COG2RIS0), 5
#define G2RIS6                           BANKMASK(COG2RIS0), 6
#define G2RIS7                           BANKMASK(COG2RIS0), 7
#define G2RIS8                           BANKMASK(COG2RIS1), 0
#define G2RIS9                           BANKMASK(COG2RIS1), 1
#define G2RSIM0                          BANKMASK(COG2RSIM0), 0
#define G2RSIM1                          BANKMASK(COG2RSIM0), 1
#define G2RSIM10                         BANKMASK(COG2RSIM1), 2
#define G2RSIM11                         BANKMASK(COG2RSIM1), 3
#define G2RSIM12                         BANKMASK(COG2RSIM1), 4
#define G2RSIM13                         BANKMASK(COG2RSIM1), 5
#define G2RSIM14                         BANKMASK(COG2RSIM1), 6
#define G2RSIM15                         BANKMASK(COG2RSIM1), 7
#define G2RSIM2                          BANKMASK(COG2RSIM0), 2
#define G2RSIM3                          BANKMASK(COG2RSIM0), 3
#define G2RSIM4                          BANKMASK(COG2RSIM0), 4
#define G2RSIM5                          BANKMASK(COG2RSIM0), 5
#define G2RSIM6                          BANKMASK(COG2RSIM0), 6
#define G2RSIM7                          BANKMASK(COG2RSIM0), 7
#define G2RSIM8                          BANKMASK(COG2RSIM1), 0
#define G2RSIM9                          BANKMASK(COG2RSIM1), 1
#define G2SDATA                          BANKMASK(COG2STR), 4
#define G2SDATB                          BANKMASK(COG2STR), 5
#define G2SDATC                          BANKMASK(COG2STR), 6
#define G2SDATD                          BANKMASK(COG2STR), 7
#define G2STRA                           BANKMASK(COG2STR), 0
#define G2STRB                           BANKMASK(COG2STR), 1
#define G2STRC                           BANKMASK(COG2STR), 2
#define G2STRD                           BANKMASK(COG2STR), 3
#define GCEN                             BANKMASK(SSP1CON2), 7
#define GIE                              BANKMASK(INTCON), 7
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define HFIOFL                           BANKMASK(OSCSTAT), 3
#define HFIOFR                           BANKMASK(OSCSTAT), 4
#define HFIOFS                           BANKMASK(OSCSTAT), 0
#define HIDC4                            BANKMASK(HIDRVC), 4
#define HIDC5                            BANKMASK(HIDRVC), 5
#define INLVLA0                          BANKMASK(INLVLA), 0
#define INLVLA1                          BANKMASK(INLVLA), 1
#define INLVLA2                          BANKMASK(INLVLA), 2
#define INLVLA3                          BANKMASK(INLVLA), 3
#define INLVLA4                          BANKMASK(INLVLA), 4
#define INLVLA5                          BANKMASK(INLVLA), 5
#define INLVLB4                          BANKMASK(INLVLB), 4
#define INLVLB5                          BANKMASK(INLVLB), 5
#define INLVLB6                          BANKMASK(INLVLB), 6
#define INLVLB7                          BANKMASK(INLVLB), 7
#define INLVLC0                          BANKMASK(INLVLC), 0
#define INLVLC1                          BANKMASK(INLVLC), 1
#define INLVLC2                          BANKMASK(INLVLC), 2
#define INLVLC3                          BANKMASK(INLVLC), 3
#define INLVLC4                          BANKMASK(INLVLC), 4
#define INLVLC5                          BANKMASK(INLVLC), 5
#define INLVLC6                          BANKMASK(INLVLC), 6
#define INLVLC7                          BANKMASK(INLVLC), 7
#define INTE                             BANKMASK(INTCON), 4
#define INTEDG                           BANKMASK(OPTION_REG), 6
#define INTF                             BANKMASK(INTCON), 1
#define IOCAF0                           BANKMASK(IOCAF), 0
#define IOCAF1                           BANKMASK(IOCAF), 1
#define IOCAF2                           BANKMASK(IOCAF), 2
#define IOCAF3                           BANKMASK(IOCAF), 3
#define IOCAF4                           BANKMASK(IOCAF), 4
#define IOCAF5                           BANKMASK(IOCAF), 5
#define IOCAN0                           BANKMASK(IOCAN), 0
#define IOCAN1                           BANKMASK(IOCAN), 1
#define IOCAN2                           BANKMASK(IOCAN), 2
#define IOCAN3                           BANKMASK(IOCAN), 3
#define IOCAN4                           BANKMASK(IOCAN), 4
#define IOCAN5                           BANKMASK(IOCAN), 5
#define IOCAP0                           BANKMASK(IOCAP), 0
#define IOCAP1                           BANKMASK(IOCAP), 1
#define IOCAP2                           BANKMASK(IOCAP), 2
#define IOCAP3                           BANKMASK(IOCAP), 3
#define IOCAP4                           BANKMASK(IOCAP), 4
#define IOCAP5                           BANKMASK(IOCAP), 5
#define IOCBF4                           BANKMASK(IOCBF), 4
#define IOCBF5                           BANKMASK(IOCBF), 5
#define IOCBF6                           BANKMASK(IOCBF), 6
#define IOCBF7                           BANKMASK(IOCBF), 7
#define IOCBN4                           BANKMASK(IOCBN), 4
#define IOCBN5                           BANKMASK(IOCBN), 5
#define IOCBN6                           BANKMASK(IOCBN), 6
#define IOCBN7                           BANKMASK(IOCBN), 7
#define IOCBP4                           BANKMASK(IOCBP), 4
#define IOCBP5                           BANKMASK(IOCBP), 5
#define IOCBP6                           BANKMASK(IOCBP), 6
#define IOCBP7                           BANKMASK(IOCBP), 7
#define IOCCF0                           BANKMASK(IOCCF), 0
#define IOCCF1                           BANKMASK(IOCCF), 1
#define IOCCF2                           BANKMASK(IOCCF), 2
#define IOCCF3                           BANKMASK(IOCCF), 3
#define IOCCF4                           BANKMASK(IOCCF), 4
#define IOCCF5                           BANKMASK(IOCCF), 5
#define IOCCF6                           BANKMASK(IOCCF), 6
#define IOCCF7                           BANKMASK(IOCCF), 7
#define IOCCN0                           BANKMASK(IOCCN), 0
#define IOCCN1                           BANKMASK(IOCCN), 1
#define IOCCN2                           BANKMASK(IOCCN), 2
#define IOCCN3                           BANKMASK(IOCCN), 3
#define IOCCN4                           BANKMASK(IOCCN), 4
#define IOCCN5                           BANKMASK(IOCCN), 5
#define IOCCN6                           BANKMASK(IOCCN), 6
#define IOCCN7                           BANKMASK(IOCCN), 7
#define IOCCP0                           BANKMASK(IOCCP), 0
#define IOCCP1                           BANKMASK(IOCCP), 1
#define IOCCP2                           BANKMASK(IOCCP), 2
#define IOCCP3                           BANKMASK(IOCCP), 3
#define IOCCP4                           BANKMASK(IOCCP), 4
#define IOCCP5                           BANKMASK(IOCCP), 5
#define IOCCP6                           BANKMASK(IOCCP), 6
#define IOCCP7                           BANKMASK(IOCCP), 7
#define IOCIE                            BANKMASK(INTCON), 3
#define IOCIF                            BANKMASK(INTCON), 0
#define IRCF0                            BANKMASK(OSCCON), 3
#define IRCF1                            BANKMASK(OSCCON), 4
#define IRCF2                            BANKMASK(OSCCON), 5
#define IRCF3                            BANKMASK(OSCCON), 6
#define LATA0                            BANKMASK(LATA), 0
#define LATA1                            BANKMASK(LATA), 1
#define LATA2                            BANKMASK(LATA), 2
#define LATA4                            BANKMASK(LATA), 4
#define LATA5                            BANKMASK(LATA), 5
#define LATB4                            BANKMASK(LATB), 4
#define LATB5                            BANKMASK(LATB), 5
#define LATB6                            BANKMASK(LATB), 6
#define LATB7                            BANKMASK(LATB), 7
#define LATC0                            BANKMASK(LATC), 0
#define LATC1                            BANKMASK(LATC), 1
#define LATC2                            BANKMASK(LATC), 2
#define LATC3                            BANKMASK(LATC), 3
#define LATC4                            BANKMASK(LATC), 4
#define LATC5                            BANKMASK(LATC), 5
#define LATC6                            BANKMASK(LATC), 6
#define LATC7                            BANKMASK(LATC), 7
#define LC1D1S0                          BANKMASK(CLC1SEL0), 0
#define LC1D1S1                          BANKMASK(CLC1SEL0), 1
#define LC1D1S2                          BANKMASK(CLC1SEL0), 2
#define LC1D1S3                          BANKMASK(CLC1SEL0), 3
#define LC1D1S4                          BANKMASK(CLC1SEL0), 4
#define LC1D2S0                          BANKMASK(CLC1SEL1), 0
#define LC1D2S1                          BANKMASK(CLC1SEL1), 1
#define LC1D2S2                          BANKMASK(CLC1SEL1), 2
#define LC1D2S3                          BANKMASK(CLC1SEL1), 3
#define LC1D2S4                          BANKMASK(CLC1SEL1), 4
#define LC1D3S0                          BANKMASK(CLC1SEL2), 0
#define LC1D3S1                          BANKMASK(CLC1SEL2), 1
#define LC1D3S2                          BANKMASK(CLC1SEL2), 2
#define LC1D3S3                          BANKMASK(CLC1SEL2), 3
#define LC1D3S4                          BANKMASK(CLC1SEL2), 4
#define LC1D4S0                          BANKMASK(CLC1SEL3), 0
#define LC1D4S1                          BANKMASK(CLC1SEL3), 1
#define LC1D4S2                          BANKMASK(CLC1SEL3), 2
#define LC1D4S3                          BANKMASK(CLC1SEL3), 3
#define LC1D4S4                          BANKMASK(CLC1SEL3), 4
#define LC1EN                            BANKMASK(CLC1CON), 7
#define LC1G1D1N                         BANKMASK(CLC1GLS0), 0
#define LC1G1D1T                         BANKMASK(CLC1GLS0), 1
#define LC1G1D2N                         BANKMASK(CLC1GLS0), 2
#define LC1G1D2T                         BANKMASK(CLC1GLS0), 3
#define LC1G1D3N                         BANKMASK(CLC1GLS0), 4
#define LC1G1D3T                         BANKMASK(CLC1GLS0), 5
#define LC1G1D4N                         BANKMASK(CLC1GLS0), 6
#define LC1G1D4T                         BANKMASK(CLC1GLS0), 7
#define LC1G1POL                         BANKMASK(CLC1POL), 0
#define LC1G2D1N                         BANKMASK(CLC1GLS1), 0
#define LC1G2D1T                         BANKMASK(CLC1GLS1), 1
#define LC1G2D2N                         BANKMASK(CLC1GLS1), 2
#define LC1G2D2T                         BANKMASK(CLC1GLS1), 3
#define LC1G2D3N                         BANKMASK(CLC1GLS1), 4
#define LC1G2D3T                         BANKMASK(CLC1GLS1), 5
#define LC1G2D4N                         BANKMASK(CLC1GLS1), 6
#define LC1G2D4T                         BANKMASK(CLC1GLS1), 7
#define LC1G2POL                         BANKMASK(CLC1POL), 1
#define LC1G3D1N                         BANKMASK(CLC1GLS2), 0
#define LC1G3D1T                         BANKMASK(CLC1GLS2), 1
#define LC1G3D2N                         BANKMASK(CLC1GLS2), 2
#define LC1G3D2T                         BANKMASK(CLC1GLS2), 3
#define LC1G3D3N                         BANKMASK(CLC1GLS2), 4
#define LC1G3D3T                         BANKMASK(CLC1GLS2), 5
#define LC1G3D4N                         BANKMASK(CLC1GLS2), 6
#define LC1G3D4T                         BANKMASK(CLC1GLS2), 7
#define LC1G3POL                         BANKMASK(CLC1POL), 2
#define LC1G4D1N                         BANKMASK(CLC1GLS3), 0
#define LC1G4D1T                         BANKMASK(CLC1GLS3), 1
#define LC1G4D2N                         BANKMASK(CLC1GLS3), 2
#define LC1G4D2T                         BANKMASK(CLC1GLS3), 3
#define LC1G4D3N                         BANKMASK(CLC1GLS3), 4
#define LC1G4D3T                         BANKMASK(CLC1GLS3), 5
#define LC1G4D4N                         BANKMASK(CLC1GLS3), 6
#define LC1G4D4T                         BANKMASK(CLC1GLS3), 7
#define LC1G4POL                         BANKMASK(CLC1POL), 3
#define LC1INTN                          BANKMASK(CLC1CON), 3
#define LC1INTP                          BANKMASK(CLC1CON), 4
#define LC1MODE0                         BANKMASK(CLC1CON), 0
#define LC1MODE1                         BANKMASK(CLC1CON), 1
#define LC1MODE2                         BANKMASK(CLC1CON), 2
#define LC1OUT                           BANKMASK(CLC1CON), 5
#define LC1POL                           BANKMASK(CLC1POL), 7
#define LC2D1S0                          BANKMASK(CLC2SEL0), 0
#define LC2D1S1                          BANKMASK(CLC2SEL0), 1
#define LC2D1S2                          BANKMASK(CLC2SEL0), 2
#define LC2D1S3                          BANKMASK(CLC2SEL0), 3
#define LC2D1S4                          BANKMASK(CLC2SEL0), 4
#define LC2D2S0                          BANKMASK(CLC2SEL1), 0
#define LC2D2S1                          BANKMASK(CLC2SEL1), 1
#define LC2D2S2                          BANKMASK(CLC2SEL1), 2
#define LC2D2S3                          BANKMASK(CLC2SEL1), 3
#define LC2D2S4                          BANKMASK(CLC2SEL1), 4
#define LC2D3S0                          BANKMASK(CLC2SEL2), 0
#define LC2D3S1                          BANKMASK(CLC2SEL2), 1
#define LC2D3S2                          BANKMASK(CLC2SEL2), 2
#define LC2D3S3                          BANKMASK(CLC2SEL2), 3
